[
  {
    "id": 77,
    "name": "Southwest Chicken Salad",
    "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/07/Southwest-Chicken-Salad-6.jpg",
    "description": "Southwest Chicken Salad is a hearty and flavorful salad featuring seasoned grilled chicken breast, black beans, corn kernels, avocado, tomatoes, and crunchy tortilla strips. Tossed in a creamy cilantro lime dressing, this salad is bursting with Tex-Mex flavors and textures. Enjoy Southwest Chicken Salad as a satisfying main course or lunch option.",
    "category": "Salad",
    "ingredients": [
      "2 chicken breasts, grilled and sliced",
      "4 cups mixed salad greens",
      "1 cup black beans, drained and rinsed",
      "1 cup corn kernels, cooked",
      "1 avocado, diced",
      "1 cup cherry tomatoes, halved",
      "1/2 cup tortilla strips",
      "1/4 cup chopped cilantro",
      "1/4 cup sour cream",
      "2 tablespoons mayonnaise",
      "2 tablespoons fresh lime juice",
      "1 teaspoon chili powder",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a large salad bowl, combine grilled and sliced chicken breasts, mixed salad greens, drained and rinsed black beans, cooked corn kernels, diced avocado, halved cherry tomatoes, tortilla strips, and chopped cilantro.",
      "In a small bowl, whisk together sour cream, mayonnaise, fresh lime juice, chili powder, salt, and black pepper to make the dressing.",
      "Drizzle the dressing over the salad ingredients and toss gently to combine all the components.",
      "Serve Southwest Chicken Salad immediately as a main course or lunch option.",
      "Enjoy your homemade Southwest Chicken Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Creamy",
      "Spicy",
      "Tex-Mex"
    ],
    "time": "30 minutes",
    "best": "Cold"
  },
  {
    "id": 7,
    "name": "Creme Brulee",
    "image": "https://www.onceuponachef.com/images/2023/02/Creme-brulee-1-1200x814.jpg",
    "description": "Creme Brulee is a classic French dessert featuring a rich custard base topped with a layer of caramelized sugar. The custard is velvety smooth, infused with vanilla, and delicately sweet. The contrast between the crunchy caramelized sugar topping and the creamy custard underneath creates a luxurious texture and a symphony of flavorss. Creme Brulee is often served chilled, allowing the caramelized sugar to crackle under the spoon, revealing the luscious custard beneath.",
    "category": "Dessert",
    "ingredients": [
      "2 cups heavy cream",
      "1 vanilla bean, split and scraped",
      "5 large egg yolks",
      "1/2 cup granulated sugar",
      "1/4 cup granulated sugar for topping"
    ],
    "instructions": [
      "Preheat the oven to 325°F (160°C).",
      "In a saucepan, heat cream and vanilla bean (including the pod) over medium heat until it just starts to simmer. Remove from heat and let steep for 15 minutes. Remove vanilla bean pod.",
      "In a medium bowl, whisk together egg yolks and 1/2 cup sugar until well blended and slightly thickened.",
      "Slowly pour the hot cream into the egg yolk mixture, whisking constantly to prevent curdling.",
      "Pour the mixture into four 6-ounce ramekins. Place the ramekins in a baking dish and add hot water to the dish until it reaches halfway up the sides of the ramekins.",
      "Bake for 45 to 50 minutes, or until the custards are set but still slightly jiggly in the center.",
      "Remove the ramekins from the water bath and let cool to room temperature. Refrigerate for at least 2 hours, or overnight.",
      "Before serving, sprinkle 1 tablespoon sugar evenly over each custard. Use a kitchen torch to caramelize the sugar, forming a crispy top."
    ],
    "servings": 4,
    "flavors": [
      "Sweet"
    ],
    "time": "3 hours",
    "best": "Cold"
  },
  {
    "id": 61,
    "name": "Grilled Swordfish Steaks",
    "image": "https://www.thespruceeats.com/thmb/XmVx8g4kVzkA5Qqs4ebH-VhMOdg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/grilled-swordfish-steak-succulent-seafood-912711-hero-01-3b38a6a9c4ca47b69b458bbf211882ae.jpg",
    "description": "Grilled Swordfish Steaks are thick and meaty steaks marinated in a zesty lemon herb marinade and grilled to perfection. The swordfish steaks develop a smoky char on the outside while remaining tender and flavorful inside. Serve these steaks with a side of roasted vegetables for a hearty and nutritious meal.",
    "category": "Seafood",
    "ingredients": [
      "4 swordfish steaks, about 1 inch thick",
      "1/4 cup olive oil",
      "2 tablespoons fresh lemon juice",
      "2 cloves garlic, minced",
      "1 teaspoon dried oregano",
      "1 teaspoon dried thyme",
      "Salt and black pepper, to taste",
      "Lemon wedges and fresh herbs, for garnish"
    ],
    "instructions": [
      "In a shallow dish, whisk together olive oil, fresh lemon juice, minced garlic, dried oregano, dried thyme, salt, and black pepper.",
      "Add swordfish steaks to the marinade, turning to coat evenly. Cover and refrigerate for 30 minutes to 1 hour.",
      "Preheat grill to medium-high heat. Brush grill grates lightly with oil to prevent sticking.",
      "Remove swordfish steaks from marinade and grill for 4-5 minutes per side, or until fish flakes easily with a fork and internal temperature reaches 145°F (63°C).",
      "Transfer grilled swordfish steaks to a serving platter and garnish with lemon wedges and fresh herbs.",
      "Serve hot and enjoy your homemade Grilled Swordfish Steaks!"
    ],
    "servings": 4,
    "flavors": [
      "Smoky",
      "Zesty",
      "Herbaceous"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 40,
    "name": "French Onion Soup",
    "image": "https://www.southernliving.com/thmb/666OZE8KPnqG7fzFsY5lAGOw3Og=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Southern_Living_Slow-Cooker-French-Onion-Soup-35-1-52753713836a4b0d84b4701e27cb4e7e.jpg",
    "description": "French Onion Soup is a rich and flavorful soup featuring caramelized onions simmered in a beefy broth, topped with toasted baguette slices and melted Gruyère cheese. It has a deep and savory flavors profile with a hint of sweetness from the caramelized onions. French Onion Soup is perfect for cold winter days, offering a comforting and indulgent experience.",
    "category": "Soup or Stew",
    "ingredients": [
      "4 large onions, thinly sliced",
      "3 tablespoons unsalted butter",
      "2 tablespoons olive oil",
      "1 teaspoon sugar",
      "6 cups beef broth",
      "1/2 cup dry white wine (optional)",
      "1 bay leaf",
      "4 slices baguette, toasted",
      "1 cup grated Gruyère cheese",
      "Salt and pepper to taste",
      "Fresh thyme for garnish"
    ],
    "instructions": [
      "In a large pot or Dutch oven, melt butter and olive oil over medium heat.",
      "Add sliced onions and cook, stirring occasionally, until caramelized and golden brown, about 30-40 minutes.",
      "Sprinkle sugar over the onions and cook for an additional 5 minutes to enhance caramelization.",
      "Deglaze the pot with white wine, scraping up any browned bits from the bottom.",
      "Add beef broth and bay leaf. Bring to a boil, then reduce heat to low and simmer for 20-30 minutes to allow flavors to meld.",
      "Season with salt and pepper to taste.",
      "Preheat broiler. Ladle soup into oven-safe bowls. Top each bowl with a slice of toasted baguette and grated Gruyère cheese.",
      "Place bowls under the broiler until cheese is melted and bubbly, about 2-3 minutes.",
      "Serve hot, garnished with fresh thyme.",
      "Enjoy your indulgent French Onion Soup!"
    ],
    "servings": 4,
    "flavors": [
      "Rich",
      "Savory",
      "Cheesy"
    ],
    "time": "1 hour",
    "best": "Hot"
  },
  {
    "id": 8,
    "name": "Banoffee Pie",
    "image": "https://marketofchoice.com/wp-content/uploads/2020/12/Banoffee-Pie-1200X925.jpg",
    "description": "Banoffee Pie is a delicious no-bake dessert with layers of ripe bananas, silky toffee, and fluffy whipped cream nestled on a buttery biscuit crust. The combination of sweet bananas and indulgent toffee creates a caramel-like flavors that melts in your mouth with each bite. Topped with a cloud of whipped cream and finished with chocolate shavings, it offers a perfect balance of textures and flavorss. This pie is easy to make yet impressively decadent, making it a favorite for any occasion.",
    "category": "Dessert",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup granulated sugar",
      "1/2 cup unsalted butter, melted",
      "1 can sweetened condensed milk",
      "3 large bananas, sliced",
      "1 1/2 cups heavy cream",
      "2 tablespoons granulated sugar",
      "1 teaspoon vanilla extract",
      "Chocolate shavings for garnish"
    ],
    "instructions": [
      "Combine the graham cracker crumbs, 1/4 cup sugar, and melted butter in a medium bowl. Press the mixture into the bottom and sides of a 9-inch pie dish. Refrigerate for at least 30 minutes.",
      "To make the toffee, place the unopened can of sweetened condensed milk in a large pot. Cover with water and bring to a boil. Reduce heat and simmer for 2 to 3 hours, ensuring the can is always covered with water. Carefully remove the can from the water and let it cool completely before opening.",
      "Spread the toffee evenly over the chilled crust. Arrange the banana slices over the toffee layer.",
      "In a medium bowl, whip the heavy cream with 2 tablespoons of sugar and the vanilla extract until soft peaks form.",
      "Spread the whipped cream over the banana layer. Garnish with chocolate shavings.",
      "Refrigerate the pie for at least 2 hours before serving."
    ],
    "servings": 8,
    "flavors": [
      "Sweet"
    ],
    "time": "3 hours and 30 minutes",
    "best": "Cold"
  },
  {
    "id": 47,
    "name": "Lemon Poppy Seed Muffins",
    "image": "https://www.theconsciousplantkitchen.com/wp-content/uploads/2023/03/Vegan-Lemon-Poppy-Seed-Muffins.jpg",
    "description": "Lemon Poppy Seed Muffins are moist and tender muffins bursting with bright lemon flavor and speckled with poppy seeds for a delightful crunch. These muffins are a perfect combination of tangy citrus and subtle sweetness, making them an ideal treat for breakfast or a midday snack.",
    "category": "Baked Goods",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 cup granulated sugar",
      "2 tablespoons poppy seeds",
      "2 teaspoons baking powder",
      "1/2 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1/2 cup unsalted butter, melted and cooled",
      "1 cup buttermilk",
      "2 large eggs",
      "Zest and juice of 2 lemons",
      "1 teaspoon vanilla extract"
    ],
    "instructions": [
      "Preheat oven to 375°F (190°C). Line a 12-cup muffin tin with paper liners or grease with non-stick spray.",
      "In a large bowl, whisk together flour, sugar, poppy seeds, baking powder, baking soda, and salt.",
      "In another bowl, whisk together melted butter, buttermilk, eggs, lemon zest, lemon juice, and vanilla extract.",
      "Add wet ingredients to dry ingredients and stir until just combined. Do not overmix.",
      "Divide batter evenly among muffin cups, filling each about 3/4 full.",
      "Bake for 18-20 minutes, or until a toothpick inserted into the center comes out clean.",
      "Cool muffins in the pan for 5 minutes, then transfer to a wire rack to cool completely.",
      "Enjoy your homemade Lemon Poppy Seed Muffins!"
    ],
    "servings": 12,
    "flavors": [
      "Sweet",
      "Tangy",
      "Citrus"
    ],
    "time": "35 minutes",
    "best": "Warm"
  },
  {
    "id": 28,
    "name": "Hot Toddy",
    "image": "https://realfood.tesco.com/media/images/RFO-1400x919-HotToddy-75aecb15-2dfb-4e26-8874-f7fc7df7ec47-0-1400x919.jpg",
    "description": "Hot Toddy is a soothing hot cocktail made with whiskey, honey, lemon juice, and hot water. It's often enjoyed as a comforting drink during cold weather or as a remedy for a sore throat or cold symptoms. The warmth of the whiskey and hot water combined with the sweetness of honey and tartness of lemon creates a soothing and aromatic beverage. Hot Toddy is served hot and can be customized with spices like cinnamon or cloves for additional flavors.",
    "category": "Beverage",
    "ingredients": [
      "2 ounces whiskey",
      "1 tablespoon honey",
      "1/2 ounce fresh lemon juice",
      "1/4 cup hot water",
      "Lemon wheel and cinnamon stick for garnish (optional)"
    ],
    "instructions": [
      "In a heatproof glass or mug, combine whiskey, honey, and lemon juice.",
      "Pour in hot water and stir until honey is dissolved.",
      "Garnish with a lemon wheel and cinnamon stick if desired.",
      "Serve hot and enjoy your comforting Hot Toddy!"
    ],
    "servings": 1,
    "flavors": [
      "Warm",
      "Sweet",
      "Citrus"
    ],
    "time": "5 minutes",
    "best": "Hot"
  },
  {
    "id": 4,
    "name": "Tiramisu",
    "image": "https://www.masala.com/cloud/2022/07/20/tiramisu.jpg",
    "description": "Tiramisu is a classic Italian dessert known for its layers of coffee-soaked ladyfingers and rich mascarpone cheese mixture. The flavorss are a harmonious blend of coffee, cocoa, and creamy sweetness, creating a luxurious experience with every bite. Each layer is carefully crafted to balance the textures of soft and creamy with a slight hint of bitterness from the coffee. Topped with a generous dusting of cocoa powder, tiramisu is a sophisticated and indulgent treat that leaves a lasting impression.",
    "category": "Dessert",
    "ingredients": [
      "6 large egg yolks",
      "3/4 cup granulated sugar",
      "2/3 cup milk",
      "1 1/4 cups heavy cream",
      "1/2 teaspoon vanilla extract",
      "8 ounces mascarpone cheese",
      "1 cup strong brewed coffee, cooled",
      "1/4 cup coffee liqueur",
      "2 (3 ounce) packages ladyfingers",
      "1 tablespoon unsweetened cocoa powder"
    ],
    "instructions": [
      "In a medium saucepan, whisk together egg yolks and sugar until well blended. Whisk in milk and cook over medium heat, stirring constantly, until mixture boils. Boil gently for 1 minute, remove from heat, and allow to cool slightly. Cover tightly and chill in the refrigerator for 1 hour.",
      "In a medium bowl, beat cream with vanilla until stiff peaks form. Whisk mascarpone into yolk mixture until smooth.",
      "In a small bowl, combine coffee and coffee liqueur. Split ladyfingers in half lengthwise and drizzle with coffee mixture.",
      "Arrange half of soaked ladyfingers in the bottom of a 7x11 inch dish. Spread half of the mascarpone mixture over the ladyfingers, then half of the whipped cream. Repeat layers and sprinkle with cocoa.",
      "Cover and refrigerate for at least 4 hours, or overnight."
    ],
    "servings": 9,
    "flavors": [
      "Sweet"
    ],
    "time": "5 hours",
    "best": "Cold"
  },
  {
    "id": 36,
    "name": "Tom Yum Soup",
    "image": "https://www.thespruceeats.com/thmb/PrhhN3g0-fkHH3ULhqcOdo8X_Mk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/vegetarian-tom-yum-soup-3217762-hero-01-4872510cb5f24d9480e7a2f4b8f23c57.jpg",
    "description": "Tom Yum Soup is a spicy and sour Thai soup that features shrimp (or other proteins), mushrooms, lemongrass, kaffir lime leaves, galangal, and chili peppers in a fragrant broth. It has a bold and refreshing flavors profile, with a balance of tangy lime juice, savory fish sauce, and aromatic herbs. Tom Yum Soup is perfect for warming up on cold days or as a flavorful appetizer in a Thai-inspired meal.",
    "category": "Soup or Stew",
    "ingredients": [
      "4 cups chicken or vegetable broth",
      "1 stalk lemongrass, cut into 2-inch pieces and bruised",
      "3 kaffir lime leaves, torn",
      "1 inch galangal or ginger, sliced",
      "2 Thai bird's eye chilies, smashed",
      "1 cup mushrooms (straw mushrooms or button mushrooms), sliced",
      "1 tomato, quartered",
      "1/2 pound shrimp, peeled and deveined (or chicken, tofu, or other proteins)",
      "2 tablespoons fish sauce",
      "2 tablespoons lime juice",
      "1 teaspoon sugar",
      "Salt to taste",
      "Fresh cilantro for garnish"
    ],
    "instructions": [
      "In a pot, bring chicken or vegetable broth to a boil.",
      "Add lemongrass, kaffir lime leaves, galangal or ginger, and Thai chilies. Simmer for 5 minutes to infuse flavors.",
      "Add mushrooms, tomato, and shrimp (or other proteins). Cook until shrimp is pink and cooked through, about 3-5 minutes.",
      "Stir in fish sauce, lime juice, sugar, and salt to taste.",
      "Remove from heat and discard lemongrass, kaffir lime leaves, and galangal or ginger slices.",
      "Serve hot, garnished with fresh cilantro.",
      "Enjoy your zesty Tom Yum Soup!"
    ],
    "servings": 4,
    "flavors": [
      "Spicy",
      "Sour",
      "Aromatic"
    ],
    "time": "25 minutes",
    "best": "Hot"
  },
  {
    "id": 68,
    "name": "Cajun Shrimp and Grits",
    "image": "https://cookingwithcocktailrings.com/wp-content/uploads/2021/02/img_602c1c14ee66f.jpg",
    "description": "Cajun Shrimp and Grits is a comforting Southern dish featuring spicy Cajun-seasoned shrimp served over creamy, cheesy grits. The shrimp are cooked with bell peppers, onions, and garlic in a flavorful sauce, creating a hearty and satisfying meal. Serve Cajun Shrimp and Grits for breakfast, brunch, or dinner for a taste of Southern hospitality.",
    "category": "Seafood",
    "ingredients": [
      "1 lb large shrimp, peeled and deveined",
      "1 cup stone-ground grits",
      "4 cups water or chicken broth",
      "1/2 cup shredded cheddar cheese",
      "1/4 cup heavy cream",
      "4 tablespoons unsalted butter",
      "1 onion, diced",
      "1 bell pepper, diced",
      "2 cloves garlic, minced",
      "1 tablespoon Cajun seasoning",
      "Salt and black pepper, to taste",
      "Fresh parsley, chopped, for garnish"
    ],
    "instructions": [
      "In a medium saucepan, bring water or chicken broth to a boil. Gradually whisk in stone-ground grits, stirring constantly to prevent lumps.",
      "Reduce heat to low and simmer grits, stirring occasionally, for 20-25 minutes until thickened.",
      "Stir in shredded cheddar cheese, heavy cream, and 2 tablespoons of unsalted butter until cheese is melted and grits are creamy. Season with salt and black pepper to taste.",
      "In a large skillet, heat remaining 2 tablespoons of unsalted butter over medium heat. Add diced onion and bell pepper, cooking until softened.",
      "Add minced garlic and Cajun seasoning to the skillet, cooking for 1 minute until fragrant.",
      "Add shrimp to the skillet and cook for 2-3 minutes per side, or until shrimp are pink and opaque.",
      "Serve Cajun shrimp over creamy grits, garnished with chopped fresh parsley.",
      "Enjoy your homemade Cajun Shrimp and Grits!"
    ],
    "servings": 4,
    "flavors": [
      "Spicy",
      "Cheesy",
      "Comforting"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 2,
    "name": "Lemon Bars",
    "image": "https://hips.hearstapps.com/hmg-prod/images/lemon-bars-easter-desserts-1615996392.jpg?crop=1.00xw:0.561xh;0,0.274xh",
    "description": "Tangy and sweet lemon bars with a buttery shortbread crust. These bars offer a refreshing citrus flavors balanced by a delicate sweetness, making them a delightful treat for any season. The bright lemon filling is smooth and custardy, contrasting perfectly with the crumbly, buttery base. Finished with a dusting of powdered sugar, they are visually appealing and irresistibly delicious.",
    "category": "Dessert",
    "ingredients": [
      "1 cup unsalted butter, softened",
      "2 cups all-purpose flour",
      "1/2 cup granulated sugar",
      "4 large eggs",
      "1 1/2 cups granulated sugar",
      "1/4 cup all-purpose flour",
      "2/3 cup freshly squeezed lemon juice",
      "1 tablespoon lemon zest",
      "Powdered sugar for dusting"
    ],
    "instructions": [
      "Preheat the oven to 350°F (175°C).",
      "In a medium bowl, blend together the softened butter, 2 cups of flour, and 1/2 cup of sugar. Press into the bottom of an ungreased 9x13 inch pan.",
      "Bake for 15 to 20 minutes in the preheated oven, or until firm and golden.",
      "In another bowl, whisk together the remaining 1 1/2 cups sugar and 1/4 cup flour. Whisk in the eggs, lemon juice, and lemon zest. Pour over the baked crust.",
      "Bake for an additional 20 minutes in the preheated oven. The bars will firm up as they cool.",
      "Dust with powdered sugar, then cut into squares once completely cooled."
    ],
    "servings": 24,
    "flavors": [
      "Sweet",
      "Sour"
    ],
    "time": "45 minutes",
    "best": "Cold"
  },
  {
    "id": 33,
    "name": "Halo-Halo",
    "image": "https://www.bhg.com/thmb/xP6vr6usB1_phcXnXE75YkUcH7g=/4000x0/filters:no_upscale():strip_icc()/BHG-Halo-Halo-Hero-6MKIKIe-ar386nzeJOHjW_-354671c880d441aba6a75e75e59b1066.jpg",
    "description": "Halo-Halo is a popular Filipino dessert that translates to 'mix-mix'. It is a refreshing and colorful concoction of various ingredients layered in a tall glass, typically including shaved ice, sweetened beans, fruits like jackfruit and banana, jellies, and topped with creamy leche flan, ube (purple yam) ice cream, and a drizzle of evaporated milk. Halo-Halo offers a delightful blend of textures and flavors, from creamy to crunchy, and is enjoyed as a cool treat on hot days.",
    "category": "Beverage",
    "ingredients": [
      "1/2 cup shaved ice",
      "1/4 cup sweetened red beans (canned or homemade)",
      "1/4 cup sweetened white beans (canned or homemade)",
      "1/4 cup sweetened jackfruit (canned or fresh)",
      "1/4 cup sweetened plantains (saba bananas, canned or fresh)",
      "1/4 cup nata de coco (coconut jelly)",
      "1/4 cup kaong (sugar palm fruit)",
      "1/4 cup gulaman (agar jelly), cubed",
      "1 slice leche flan (Filipino caramel custard)",
      "1 scoop ube (purple yam) ice cream",
      "2 tablespoons evaporated milk",
      "Crushed ice, as needed"
    ],
    "instructions": [
      "In a tall glass, layer shaved ice followed by sweetened red beans, white beans, jackfruit, plantains, nata de coco, and kaong.",
      "Add cubed gulaman (agar jelly) on top of the fruit layers.",
      "Place a slice of leche flan on one side of the glass.",
      "Top with a scoop of ube ice cream.",
      "Drizzle evaporated milk over the halo-halo ingredients.",
      "Add crushed ice to fill the glass.",
      "Serve immediately with a long spoon and enjoy your refreshing Halo-Halo!"
    ],
    "servings": 1,
    "flavors": [
      "Sweet",
      "Creamy",
      "Fruity"
    ],
    "time": "15 minutes",
    "best": "Cold"
  },
  {
    "id": 25,
    "name": "Mango Lassi",
    "image": "https://media.bluediamond.com/uploads/2023/01/24175942/14_Dairy-Free_Mango_Lassi-2430x1620.jpg",
    "description": "Mango Lassi is a popular Indian yogurt-based drink infused with ripe mango pulp, yogurt, milk, and a touch of cardamom. It has a smooth and creamy texture with a refreshing tropical flavors from the mangoes. Mango Lassi is often served chilled, making it a delightful beverage to cool down with on a hot day. It can be enjoyed as a dessert drink or paired with spicy Indian dishes to balance out the flavors.",
    "category": "Beverage",
    "ingredients": [
      "1 cup ripe mango, diced (fresh or frozen)",
      "1 cup plain yogurt",
      "1/2 cup milk",
      "2 tablespoons honey or sugar",
      "1/4 teaspoon ground cardamom (optional)",
      "Ice cubes"
    ],
    "instructions": [
      "In a blender, combine diced mango, yogurt, milk, honey or sugar, and ground cardamom.",
      "Blend until smooth and creamy.",
      "Add ice cubes and blend again until smooth and frothy.",
      "Pour into glasses and serve chilled.",
      "Enjoy your refreshing Mango Lassi!"
    ],
    "servings": 2,
    "flavors": [
      "Tropical",
      "Creamy",
      "Sweet"
    ],
    "time": "10 minutes",
    "best": "Cold"
  },
  {
    "id": 42,
    "name": "Chicken Tortilla Soup",
    "image": "https://www.kyleecooks.com/wp-content/uploads/2019/08/Chicken-Tortilla-Soup-35.jpg",
    "description": "Chicken Tortilla Soup is a vibrant and flavorful soup made with shredded chicken, tomatoes, beans, corn, and spices. It's topped with crunchy tortilla strips, creamy avocado, fresh cilantro, and a squeeze of lime for a burst of freshness. This soup offers a perfect balance of textures and flavors, making it a favorite for gatherings or cozy nights at home.",
    "category": "Soup or Stew",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 onion, chopped",
      "3 garlic cloves, minced",
      "1 jalapeño pepper, seeded and minced",
      "1 teaspoon ground cumin",
      "1 teaspoon chili powder",
      "1 can (15 ounces) diced tomatoes",
      "4 cups chicken broth",
      "2 cups shredded cooked chicken",
      "1 can (15 ounces) black beans, drained and rinsed",
      "1 cup frozen corn kernels",
      "Salt and pepper to taste",
      "Tortilla strips, avocado, cilantro, lime wedges for garnish"
    ],
    "instructions": [
      "In a large pot, heat vegetable oil over medium heat.",
      "Add chopped onion and cook until softened, about 5 minutes.",
      "Add minced garlic, jalapeño pepper, ground cumin, and chili powder. Cook for 1-2 minutes until fragrant.",
      "Stir in diced tomatoes with their juices and chicken broth. Bring to a boil.",
      "Reduce heat to low and simmer for 15-20 minutes.",
      "Add shredded chicken, black beans, and frozen corn. Simmer for an additional 10 minutes to heat through.",
      "Season with salt and pepper to taste.",
      "Serve hot, garnished with tortilla strips, avocado slices, fresh cilantro, and lime wedges.",
      "Enjoy your zesty Chicken Tortilla Soup!"
    ],
    "servings": 6,
    "flavors": [
      "Zesty",
      "Spicy",
      "Savory"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 66,
    "name": "Baked Salmon with Dill Sauce",
    "image": "https://www.mypricechopper.com/Frontend/Media/Recipes/BakedSalmonLemonDillParsley2_Web_1110x625.jpg",
    "description": "Baked Salmon with Dill Sauce is a healthy and flavorful dish featuring tender salmon fillets baked to perfection and served with a creamy dill sauce. The salmon is seasoned with herbs and lemon, complemented by the refreshing dill sauce made with Greek yogurt and fresh dill. Enjoy this nutritious and delicious meal with steamed vegetables or roasted potatoes.",
    "category": "Seafood",
    "ingredients": [
      "4 salmon fillets, skin-on",
      "2 tablespoons olive oil",
      "1 tablespoon fresh lemon juice",
      "1 teaspoon dried dill",
      "Salt and black pepper, to taste",
      "Lemon slices and fresh dill sprigs, for garnish"
    ],
    "instructions": [
      "Preheat oven to 400°F (200°C). Line a baking sheet with parchment paper.",
      "Place salmon fillets on the prepared baking sheet, skin-side down. Drizzle olive oil and fresh lemon juice over the salmon.",
      "Season salmon with dried dill, salt, and black pepper to taste.",
      "Bake salmon for 12-15 minutes, or until fish flakes easily with a fork and internal temperature reaches 145°F (63°C).",
      "While salmon is baking, prepare the dill sauce by combining Greek yogurt, fresh dill, salt, and pepper in a bowl.",
      "Serve baked salmon hot with dill sauce on the side. Garnish with lemon slices and fresh dill sprigs.",
      "Enjoy your homemade Baked Salmon with Dill Sauce!"
    ],
    "servings": 4,
    "flavors": [
      "Herb-infused",
      "Citrusy",
      "Creamy"
    ],
    "time": "20 minutes",
    "best": "Hot"
  },
  {
    "id": 62,
    "name": "Coconut Shrimp",
    "image": "https://www.flavcity.com/wp-content/uploads/2018/12/keto-coconut-shrimp-4.jpg",
    "description": "Coconut Shrimp is a tropical-inspired dish featuring crispy shrimp coated in a coconut batter and fried to golden perfection. These shrimp are sweet and savory, served with a tangy pineapple dipping sauce for a delightful burst of flavors. Enjoy them as an appetizer or main dish.",
    "category": "Seafood",
    "ingredients": [
      "1 lb large shrimp, peeled and deveined",
      "1 cup shredded coconut",
      "1 cup panko breadcrumbs",
      "1/2 cup all-purpose flour",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "2 eggs, beaten",
      "Vegetable oil, for frying",
      "Pineapple dipping sauce, for serving"
    ],
    "instructions": [
      "In a shallow dish, combine shredded coconut and panko breadcrumbs.",
      "In another dish, season all-purpose flour with salt and black pepper.",
      "Dredge shrimp in seasoned flour, shaking off excess. Dip shrimp in beaten eggs, then coat thoroughly with coconut breadcrumb mixture.",
      "Heat vegetable oil in a large skillet or pot over medium-high heat until it reaches 350°F (175°C).",
      "Fry coconut shrimp in batches for 2-3 minutes until golden brown and crispy. Drain on paper towels.",
      "Serve coconut shrimp hot with pineapple dipping sauce on the side.",
      "Enjoy your homemade Coconut Shrimp!"
    ],
    "servings": 4,
    "flavors": [
      "Crispy",
      "Coconutty",
      "Sweet"
    ],
    "time": "30 minutes",
    "best": "Hot"
  },
  {
    "id": 75,
    "name": "Chicken Caesar Salad",
    "image": "https://iamafoodblog.b-cdn.net/wp-content/uploads/2021/08/chicken-caesar-salad-5709w.jpg",
    "description": "Chicken Caesar Salad is a classic salad featuring crisp romaine lettuce, tender grilled chicken breast, crunchy croutons, and shaved Parmesan cheese, all tossed in a creamy Caesar dressing. This salad is packed with flavors and textures, making it a popular choice for a satisfying meal. Enjoy Chicken Caesar Salad as a main course or hearty lunch option.",
    "category": "Salad",
    "ingredients": [
      "2 chicken breasts, grilled and sliced",
      "1 head romaine lettuce, chopped",
      "1 cup croutons",
      "1/2 cup shaved Parmesan cheese",
      "1/2 cup Caesar dressing",
      "1 tablespoon lemon juice",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a large salad bowl, combine chopped romaine lettuce, grilled and sliced chicken breasts, croutons, and shaved Parmesan cheese.",
      "Drizzle Caesar dressing and fresh lemon juice over the salad ingredients. Season with salt and black pepper to taste.",
      "Toss the salad gently to coat all the components with the dressing.",
      "Serve Chicken Caesar Salad immediately as a main course or lunch option.",
      "Enjoy your homemade Chicken Caesar Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Creamy",
      "Savory",
      "Crunchy"
    ],
    "time": "25 minutes",
    "best": "Cold"
  },
  {
    "id": 52,
    "name": "Fried Chicken",
    "image": "https://lakegenevacountrymeats.com/wp-content/uploads/Fried-Chicken-Pieces.jpg",
    "description": "Crispy and flavorful fried chicken with a golden-brown crust and tender, juicy meat. This classic dish is seasoned with a blend of herbs and spices, coated in a buttermilk batter, and fried to perfection. Serve hot with your favorite sides for a comforting meal.",
    "category": "Fried or Grilled",
    "ingredients": [
      "1 whole chicken, cut into pieces",
      "2 cups buttermilk",
      "2 cups all-purpose flour",
      "1 tablespoon salt",
      "1 tablespoon paprika",
      "1 teaspoon black pepper",
      "1 teaspoon garlic powder",
      "Vegetable oil, for frying"
    ],
    "instructions": [
      "In a large bowl, soak chicken pieces in buttermilk for at least 1 hour or overnight in the refrigerator.",
      "In another bowl, combine flour, salt, paprika, black pepper, and garlic powder.",
      "Remove chicken from buttermilk, allowing excess to drip off, and coat each piece thoroughly in the flour mixture.",
      "Heat vegetable oil in a large skillet or pot over medium-high heat until it reaches 350°F (175°C).",
      "Carefully place chicken pieces in the hot oil, frying in batches if necessary to avoid overcrowding.",
      "Fry chicken for 12-15 minutes per side, or until golden brown and cooked through. Internal temperature should reach 165°F (74°C).",
      "Transfer fried chicken to a wire rack or paper towels to drain excess oil.",
      "Serve hot and enjoy your homemade Fried Chicken!"
    ],
    "servings": 4,
    "flavors": [
      "Crispy",
      "Savory",
      "Herbaceous"
    ],
    "time": "2 hours",
    "best": "Hot"
  },
  {
    "id": 27,
    "name": "Thai Iced Tea",
    "image": "https://lonumedhu.com/sites/default/files/thai-iced-tea-cover.jpg",
    "description": "Thai Iced Tea is a sweet and creamy beverage made with Thai tea leaves, condensed milk, and evaporated milk. The tea leaves are steeped to create a strong brew, then sweetened with sugar and topped with creamy milk. Thai Iced Tea is traditionally served over ice, resulting in a vibrant orange color with layers of flavors from the tea and milks. It's a popular drink in Thai restaurants and offers a delightful balance of sweet and tea flavors.",
    "category": "Beverage",
    "ingredients": [
      "2 tablespoons Thai tea leaves",
      "1 cup boiling water",
      "2 tablespoons sugar",
      "2 tablespoons sweetened condensed milk",
      "2 tablespoons evaporated milk",
      "Ice cubes"
    ],
    "instructions": [
      "Steep Thai tea leaves in boiling water for 5 minutes. Strain and discard tea leaves.",
      "Stir in sugar until dissolved.",
      "Pour sweetened tea into a glass filled with ice cubes.",
      "Drizzle in sweetened condensed milk and evaporated milk.",
      "Stir gently to combine.",
      "Serve immediately and enjoy your Thai Iced Tea!"
    ],
    "servings": 1,
    "flavors": [
      "Sweet",
      "Creamy",
      "Tea"
    ],
    "time": "10 minutes",
    "best": "Cold"
  },
  {
    "id": 59,
    "name": "Grilled Chicken Skewers",
    "image": "https://thecafesucrefarine.com/wp-content/uploads/Peruvian-Grilled-Chicken-Skewers-4-2.jpg",
    "description": "Grilled Chicken Skewers are juicy and flavorful skewers featuring marinated chicken pieces grilled to perfection. The chicken is marinated in a blend of herbs, spices, and citrus, imparting a delicious smoky flavor when grilled. Serve these skewers with a side of rice and a fresh salad for a satisfying meal.",
    "category": "Fried or Grilled",
    "ingredients": [
      "1 lb chicken breast or thigh meat, cut into cubes",
      "1/4 cup olive oil",
      "2 tablespoons soy sauce",
      "2 tablespoons fresh lemon juice",
      "2 cloves garlic, minced",
      "1 teaspoon paprika",
      "1 teaspoon cumin",
      "Salt and black pepper, to taste",
      "Wooden skewers, soaked in water"
    ],
    "instructions": [
      "In a bowl, whisk together olive oil, soy sauce, lemon juice, minced garlic, paprika, cumin, salt, and black pepper.",
      "Add chicken cubes to the marinade, tossing to coat evenly. Cover and refrigerate for at least 30 minutes, up to 2 hours.",
      "Preheat grill to medium-high heat. Thread marinated chicken pieces onto soaked wooden skewers.",
      "Grill chicken skewers for 5-7 minutes per side, or until chicken is cooked through and grill marks appear.",
      "Transfer grilled chicken skewers to a serving platter and garnish with fresh herbs if desired.",
      "Serve hot and enjoy your homemade Grilled Chicken Skewers!"
    ],
    "servings": 4,
    "flavors": [
      "Juicy",
      "Citrusy",
      "Smoky"
    ],
    "time": "40 minutes",
    "best": "Hot"
  },
  {
    "id": 46,
    "name": "Oatmeal Cookies",
    "image": "https://www.yummytoddlerfood.com/wp-content/uploads/2024/05/healthy-oatmeal-cookies-on-tray.jpg",
    "description": "Soft and Chewy Oatmeal Cookies are hearty treats packed with oats, raisins, and a hint of cinnamon. These cookies are soft in the center with slightly crispy edges, offering a comforting blend of oats and sweetness that makes them a favorite for all ages.",
    "category": "Baked Goods",
    "ingredients": [
      "1 cup unsalted butter, softened",
      "1 cup packed light brown sugar",
      "1/2 cup granulated sugar",
      "2 large eggs",
      "1 teaspoon vanilla extract",
      "1 1/2 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1/2 teaspoon salt",
      "1 teaspoon ground cinnamon",
      "3 cups old-fashioned rolled oats",
      "1 cup raisins or chocolate chips"
    ],
    "instructions": [
      "Preheat oven to 350°F (175°C). Line baking sheets with parchment paper.",
      "In a large bowl, cream together softened butter, brown sugar, and granulated sugar until smooth.",
      "Beat in eggs one at a time, then stir in vanilla extract.",
      "Combine flour, baking soda, salt, and ground cinnamon; gradually blend into the creamed mixture.",
      "Mix in rolled oats and raisins or chocolate chips until evenly distributed.",
      "Drop rounded spoonfuls of dough onto prepared baking sheets.",
      "Bake for 10 to 12 minutes until edges are golden brown.",
      "Cool cookies on baking sheets for 5 minutes before transferring to wire racks to cool completely.",
      "Enjoy your homemade Soft and Chewy Oatmeal Cookies!"
    ],
    "servings": 24,
    "flavors": [
      "Sweet",
      "Oatmeal",
      "Cinnamon"
    ],
    "time": "30 minutes",
    "best": "Warm"
  },
  {
    "id": 43,
    "name": "Homemade Cinnamon Rolls",
    "image": "https://www.southernliving.com/thmb/xJAwtFFDmfCvPeYs30U8bOxnM40=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Cinnamon_Rolls_035-8ad1ec9a768f486ba1dc9b24e581b27e.jpg",
    "description": "Homemade Cinnamon Rolls are soft, fluffy rolls swirled with cinnamon sugar and topped with a luscious cream cheese icing. These rolls are perfect for breakfast or as a sweet treat any time of day, offering a comforting blend of warm spices and sweet indulgence.",
    "category": "Baked Goods",
    "ingredients": [
      "1 cup warm milk (110°F)",
      "2/3 cup granulated sugar, divided",
      "2 1/4 teaspoons active dry yeast",
      "1/2 cup unsalted butter, melted",
      "2 large eggs, room temperature",
      "1/2 teaspoon salt",
      "4 1/2 cups all-purpose flour, plus more for dusting",
      "1/3 cup unsalted butter, softened",
      "1 cup packed brown sugar",
      "3 tablespoons ground cinnamon",
      "1/2 cup unsalted butter, softened",
      "4 ounces cream cheese, softened",
      "2 cups powdered sugar",
      "1 teaspoon vanilla extract"
    ],
    "instructions": [
      "In a large bowl, combine warm milk, 1/3 cup granulated sugar, and yeast. Let sit for 5-10 minutes until foamy.",
      "Stir in melted butter, eggs, salt, and 4 cups of flour until dough comes together.",
      "Knead the dough on a lightly floured surface for 5-7 minutes, adding more flour as needed, until smooth and elastic.",
      "Place dough in a greased bowl, cover, and let rise in a warm place until doubled in size, about 1 hour.",
      "In a small bowl, mix together softened butter, brown sugar, and cinnamon to make the filling.",
      "Punch down the dough and roll it out on a lightly floured surface into a 16x21-inch rectangle.",
      "Spread the filling evenly over the dough.",
      "Starting with the long edge, roll up the dough tightly and pinch the seam to seal.",
      "Cut into 12-15 slices and place them in a greased 9x13-inch baking pan.",
      "Cover and let rise again in a warm place until doubled, about 30 minutes.",
      "Preheat oven to 350°F (175°C).",
      "Bake cinnamon rolls for 20-25 minutes until golden brown.",
      "While rolls are baking, beat together softened butter, cream cheese, powdered sugar, and vanilla extract until smooth and creamy.",
      "Spread icing over warm cinnamon rolls.",
      "Enjoy your homemade Cinnamon Rolls!"
    ],
    "servings": 12,
    "flavors": [
      "Sweet",
      "Cinnamon",
      "Buttery"
    ],
    "time": "2 hours",
    "best": "Warm"
  },
  {
    "id": 35,
    "name": "Beef Stew",
    "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2023/09/Beef-Stew-main.jpg",
    "description": "Beef Stew is a hearty and flavorful dish featuring tender chunks of beef, potatoes, carrots, and onions cooked in a rich and savory broth. The beef is seared to develop deep flavors, then simmered low and slow until it becomes melt-in-your-mouth tender. This comforting stew is perfect for chilly evenings, offering a satisfying and nourishing meal for the whole family.",
    "category": "Soup or Stew",
    "ingredients": [
      "2 pounds stew beef, cut into 1-inch cubes",
      "3 tablespoons vegetable oil",
      "1 onion, chopped",
      "3 garlic cloves, minced",
      "4 cups beef broth",
      "1 cup red wine (optional)",
      "4 carrots, sliced",
      "4 potatoes, peeled and cubed",
      "1 teaspoon dried thyme",
      "Salt and pepper to taste",
      "Fresh parsley for garnish"
    ],
    "instructions": [
      "In a large pot or Dutch oven, heat vegetable oil over medium-high heat.",
      "Add cubed beef in batches and brown on all sides. Remove beef and set aside.",
      "In the same pot, sauté onion and garlic until softened, about 5 minutes.",
      "Deglaze the pot with red wine, scraping up any browned bits from the bottom.",
      "Add beef broth, carrots, potatoes, dried thyme, and browned beef back into the pot.",
      "Bring to a boil, then reduce heat to low and simmer covered for 1.5 to 2 hours, stirring occasionally, until beef and vegetables are tender.",
      "Season with salt and pepper to taste.",
      "Serve hot, garnished with fresh parsley.",
      "Enjoy your hearty Beef Stew!"
    ],
    "servings": 8,
    "flavors": [
      "Hearty",
      "Savory",
      "Rich"
    ],
    "time": "2.5 hours",
    "best": "Hot"
  },
  {
    "id": 23,
    "name": "Classic Hot Chocolate",
    "image": "https://www.thespruceeats.com/thmb/1c0ep60tWPHUNZPlnEoxqxSotBs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/classic-dutch-hot-chocolate-recipe-1128602-hero-01-8e3090ad1d024a25b170f5eb34b0939f.jpg",
    "description": "Classic Hot Chocolate is a rich and indulgent beverage made with cocoa powder, sugar, and milk. It's perfect for warming up on chilly days, with its creamy texture and deep chocolate flavors. This comforting drink is often topped with whipped cream or marshmallows for added decadence. Enjoy it as a soothing treat during winter months or anytime you crave a comforting drink.",
    "category": "Beverage",
    "ingredients": [
      "2 tablespoons unsweetened cocoa powder",
      "2 tablespoons granulated sugar",
      "1 cup milk",
      "1/4 teaspoon vanilla extract",
      "Whipped cream or marshmallows for topping (optional)"
    ],
    "instructions": [
      "In a small saucepan, whisk together cocoa powder, sugar, and a pinch of salt.",
      "Whisk in milk gradually until cocoa and sugar are dissolved.",
      "Heat over medium heat, stirring constantly, until hot (but not boiling).",
      "Remove from heat and stir in vanilla extract.",
      "Pour into mugs and top with whipped cream or marshmallows if desired.",
      "Serve hot and enjoy your Classic Hot Chocolate!"
    ],
    "servings": 2,
    "flavors": [
      "Sweet",
      "Chocolatey",
      "Creamy"
    ],
    "time": "10 minutes",
    "best": "Hot"
  },
  {
    "id": 69,
    "name": "Greek Salad",
    "image": "https://www.southernliving.com/thmb/8M7xjBXyPtC8dkf8JWMSRo4fbZo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Greek-Salad-With-Baked-Feta-Batch59-Beauty-03-8a9f6350bdb04f2f848741fd87bf029a.jpg",
    "description": "Greek Salad is a refreshing and colorful dish featuring crisp lettuce, juicy tomatoes, cucumber, red onion, tangy Kalamata olives, and creamy feta cheese. Tossed in a zesty lemon herb vinaigrette, this salad is bursting with Mediterranean flavors. Serve it as a side dish or add grilled chicken or shrimp for a complete meal.",
    "category": "Salad",
    "ingredients": [
      "4 cups mixed salad greens",
      "1 cucumber, sliced",
      "2 tomatoes, diced",
      "1/2 red onion, thinly sliced",
      "1/2 cup Kalamata olives",
      "1/2 cup crumbled feta cheese",
      "1/4 cup extra virgin olive oil",
      "2 tablespoons fresh lemon juice",
      "1 teaspoon dried oregano",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a large salad bowl, combine mixed salad greens, sliced cucumber, diced tomatoes, thinly sliced red onion, Kalamata olives, and crumbled feta cheese.",
      "In a small bowl, whisk together extra virgin olive oil, fresh lemon juice, dried oregano, salt, and black pepper to make the vinaigrette.",
      "Drizzle the vinaigrette over the salad and toss gently to coat all the ingredients.",
      "Serve Greek Salad immediately as a side dish or add grilled chicken or shrimp for a main course.",
      "Enjoy your homemade Greek Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Fresh",
      "Tangy",
      "Herbaceous"
    ],
    "time": "15 minutes",
    "best": "Cold"
  },
  {
    "id": 57,
    "name": "Crispy Pork Belly",
    "image": "https://www.thespruceeats.com/thmb/h4NzVMU9niJSJULK8hTmfBEFwFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/slow-roasted-pork-belly-crispy-skin-3059509-hero-01-a3056a1c9fa44bea9f6553f9f8f3a058.jpg",
    "description": "Crispy Pork Belly is a flavorful dish featuring tender pork belly with a crispy golden-brown crackling. The pork belly is seasoned with a blend of spices and roasted until the skin is crisp and the meat is juicy. Serve slices of crispy pork belly with dipping sauces and steamed rice for a satisfying meal.",
    "category": "Fried or Grilled",
    "ingredients": [
      "2 lbs pork belly, skin-on",
      "1 tablespoon salt",
      "1 teaspoon black pepper",
      "1 teaspoon five-spice powder",
      "1 tablespoon vinegar",
      "1 tablespoon soy sauce",
      "1 tablespoon cooking oil"
    ],
    "instructions": [
      "Score the pork belly skin with a sharp knife, making shallow cuts across the surface.",
      "Rub salt, black pepper, and five-spice powder all over the pork belly, including the skin.",
      "Place pork belly on a wire rack, skin-side up, and let air-dry in the refrigerator uncovered for at least 2 hours, preferably overnight.",
      "Preheat oven to 425°F (220°C). Rub vinegar all over the skin of the pork belly.",
      "Roast pork belly in the preheated oven for 30 minutes, then reduce heat to 375°F (190°C) and roast for another 30 minutes or until skin is crispy and meat is tender.",
      "Heat cooking oil in a large skillet over medium-high heat. Carefully place pork belly, skin-side down, and fry until skin is crispy and golden brown, about 3-5 minutes.",
      "Slice crispy pork belly into pieces and serve hot.",
      "Enjoy your homemade Crispy Pork Belly!"
    ],
    "servings": 4,
    "flavors": [
      "Crispy",
      "Savory",
      "Spiced"
    ],
    "time": "4 hours (including drying time)",
    "best": "Hot"
  },
  {
    "id": 67,
    "name": "Seafood Paella",
    "image": "https://www.savoryexperiments.com/wp-content/uploads/2022/05/Seafood-Paella-20.jpg",
    "description": "Seafood Paella is a vibrant Spanish rice dish packed with a variety of seafood such as shrimp, clams, mussels, and squid, flavored with saffron and paprika. This savory paella is cooked in a rich broth with vegetables and served with lemon wedges for a burst of citrus flavor. Enjoy this festive dish as a main course for gatherings and celebrations.",
    "category": "Seafood",
    "ingredients": [
      "1 lb mixed seafood (shrimp, clams, mussels, squid), cleaned and scrubbed",
      "1 1/2 cups Arborio rice",
      "4 cups seafood or chicken broth",
      "1 onion, diced",
      "1 red bell pepper, diced",
      "4 cloves garlic, minced",
      "1/2 teaspoon saffron threads",
      "1 teaspoon smoked paprika",
      "Salt and black pepper, to taste",
      "Lemon wedges, for serving",
      "Fresh parsley, chopped, for garnish"
    ],
    "instructions": [
      "In a large paella pan or skillet, heat olive oil over medium heat. Add diced onion and red bell pepper, cooking until softened.",
      "Stir in minced garlic, saffron threads, and smoked paprika, cooking for 1 minute until fragrant.",
      "Add Arborio rice to the pan, stirring to coat in the oil and spices.",
      "Pour in seafood or chicken broth, stirring gently to combine. Season with salt and black pepper to taste.",
      "Bring the broth to a boil, then reduce heat to low and simmer uncovered for 15-20 minutes, or until rice is tender and liquid is absorbed.",
      "Arrange mixed seafood over the rice mixture, pressing lightly into the rice. Cover and cook for an additional 5-7 minutes until seafood is cooked through and shells have opened.",
      "Remove from heat and let paella rest for 5 minutes before serving.",
      "Garnish with chopped fresh parsley and serve Seafood Paella hot with lemon wedges.",
      "Enjoy your homemade Seafood Paella!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Rich",
      "Saffron-infused"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 64,
    "name": "Lobster Tails with Garlic Butter",
    "image": "https://www.eatwell101.com/wp-content/uploads/2021/12/best-lobster-tail-recipes.jpg",
    "description": "Lobster Tails with Garlic Butter are luxurious and succulent lobster tails broiled to perfection with a flavorful garlic butter sauce. The lobster tails are tender and sweet, enhanced by the rich garlic butter sauce infused with lemon juice and herbs. Serve these elegant lobster tails as a centerpiece for special occasions.",
    "category": "Seafood",
    "ingredients": [
      "4 lobster tails, thawed if frozen",
      "1/2 cup unsalted butter, melted",
      "4 cloves garlic, minced",
      "2 tablespoons fresh lemon juice",
      "1 tablespoon chopped fresh parsley",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "Preheat broiler to high heat. Use kitchen shears to cut through the top shell of each lobster tail lengthwise, stopping at the tail.",
      "Gently pull the shell open to expose the meat, leaving the tail end attached.",
      "In a small bowl, combine melted butter, minced garlic, fresh lemon juice, chopped parsley, salt, and black pepper.",
      "Brush garlic butter mixture generously over each lobster tail.",
      "Place lobster tails on a baking sheet, shell side down, and broil for 10-12 minutes until lobster meat is opaque and lightly browned.",
      "Remove lobster tails from oven and brush with additional garlic butter sauce before serving.",
      "Serve hot and enjoy your homemade Lobster Tails with Garlic Butter!"
    ],
    "servings": 4,
    "flavors": [
      "Buttery",
      "Garlicky",
      "Luxurious"
    ],
    "time": "20 minutes",
    "best": "Hot"
  },
  {
    "id": 50,
    "name": "Pretzels",
    "image": "https://static01.nyt.com/images/2023/04/14/multimedia/14PRETZELSREX-hvtc/13PRETZELSREX-hvtc-superJumbo.jpg",
    "description": "Homemade Soft Pretzels are chewy on the outside and soft on the inside with a golden brown crust and a hint of salt. These pretzels are fun to make and perfect for snacking, whether enjoyed plain or dipped in your favorite mustard or cheese sauce.",
    "category": "Baked Goods",
    "ingredients": [
      "1 1/2 cups warm water (110°F)",
      "1 tablespoon granulated sugar",
      "2 teaspoons kosher salt",
      "1 package active dry yeast",
      "4 1/2 cups all-purpose flour",
      "4 tablespoons unsalted butter, melted",
      "Vegetable oil, for greasing",
      "10 cups water",
      "2/3 cup baking soda",
      "Coarse salt, for sprinkling"
    ],
    "instructions": [
      "In a large bowl, combine warm water, sugar, and kosher salt. Sprinkle yeast on top and let sit for 5 minutes until foamy.",
      "Add flour and melted butter to the yeast mixture, stirring until combined and dough forms.",
      "Knead dough on a lightly floured surface for 5 minutes until smooth and elastic.",
      "Place dough in a greased bowl, cover with a clean towel, and let rise in a warm place for 1 hour or until doubled in size.",
      "Preheat oven to 450°F (230°C). Line two baking sheets with parchment paper and lightly grease with vegetable oil.",
      "In a large pot, bring 10 cups of water and baking soda to a rolling boil.",
      "Divide dough into 12 equal portions. Roll each portion into a 20-inch rope and shape into pretzels.",
      "Boil pretzels, one or two at a time, in the baking soda water for 30 seconds, flipping once.",
      "Remove pretzels with a slotted spoon, letting excess water drain, and place on prepared baking sheets.",
      "Sprinkle pretzels with coarse salt and bake for 12-14 minutes until golden brown.",
      "Transfer pretzels to a wire rack to cool slightly before serving.",
      "Enjoy your homemade Soft Pretzels!"
    ],
    "servings": 12,
    "flavors": [
      "Chewy",
      "Salty",
      "Buttery"
    ],
    "time": "2 hours",
    "best": "Warm"
  },
  {
    "id": 76,
    "name": "Asian Cucumber Salad",
    "image": "https://www.nospoonnecessary.com/wp-content/uploads/2021/06/Asian-Cucumber-Salad.jpg",
    "description": "Asian Cucumber Salad is a refreshing and tangy salad featuring thinly sliced cucumbers, red onion, and bell peppers tossed in a sesame soy dressing. Garnished with toasted sesame seeds and fresh cilantro, this salad offers a crisp texture and vibrant flavors. Enjoy Asian Cucumber Salad as a light and flavorful side dish or appetizer.",
    "category": "Salad",
    "ingredients": [
      "2 cucumbers, thinly sliced",
      "1/2 red onion, thinly sliced",
      "1 bell pepper, thinly sliced",
      "2 tablespoons soy sauce",
      "1 tablespoon rice vinegar",
      "1 tablespoon sesame oil",
      "1 teaspoon honey",
      "1 garlic clove, minced",
      "1 teaspoon grated ginger",
      "2 tablespoons toasted sesame seeds",
      "Fresh cilantro, chopped, for garnish",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a large bowl, combine thinly sliced cucumbers, red onion, and bell pepper.",
      "In a small bowl, whisk together soy sauce, rice vinegar, sesame oil, honey, minced garlic, grated ginger, salt, and black pepper to make the dressing.",
      "Pour the dressing over the cucumber mixture and toss gently to coat all the ingredients.",
      "Sprinkle toasted sesame seeds and chopped fresh cilantro over the salad before serving.",
      "Enjoy your homemade Asian Cucumber Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Tangy",
      "Sesame-infused",
      "Fresh"
    ],
    "time": "15 minutes",
    "best": "Cold"
  },
  {
    "id": 48,
    "name": "Homemade Bagels",
    "image": "https://spicesnflavors.com/wp-content/uploads/2020/01/bagel.jpg",
    "description": "Homemade Bagels are chewy and flavorful with a golden crust and a soft interior. These bagels are made from scratch, boiled to achieve their signature texture, and then baked to perfection. Enjoy them fresh out of the oven or toasted with your favorite spreads!",
    "category": "Baked Goods",
    "ingredients": [
      "4 cups bread flour",
      "1 tablespoon granulated sugar",
      "2 teaspoons salt",
      "1 tablespoon instant yeast",
      "1 1/4 cups warm water",
      "2 tablespoons vegetable oil",
      "1 large egg, beaten (for egg wash)",
      "Optional toppings: sesame seeds, poppy seeds, everything bagel seasoning"
    ],
    "instructions": [
      "In a large bowl, whisk together bread flour, sugar, salt, and instant yeast.",
      "Add warm water and vegetable oil to the dry ingredients, stirring until a dough forms.",
      "Knead the dough on a lightly floured surface for 10 minutes until smooth and elastic.",
      "Place dough in a greased bowl, cover with a damp towel, and let rise in a warm place for 1 hour or until doubled in size.",
      "Punch down the dough and divide into 8 equal portions. Shape each portion into a ball and poke a hole in the center to form a bagel shape.",
      "Preheat oven to 425°F (220°C). Bring a large pot of water to a boil and reduce to a simmer.",
      "Boil bagels, 2-3 at a time, for 1-2 minutes per side. Remove with a slotted spoon and place on a parchment-lined baking sheet.",
      "Brush bagels with egg wash and sprinkle with toppings if desired.",
      "Bake for 20-25 minutes until golden brown, rotating the baking sheet halfway through baking.",
      "Cool bagels on a wire rack before slicing and serving.",
      "Enjoy your homemade Bagels!"
    ],
    "servings": 8,
    "flavors": [
      "Chewy",
      "Savory",
      "Bread"
    ],
    "time": "2 hours 30 minutes",
    "best": "Warm"
  },
  {
    "id": 45,
    "name": "Classic Banana Bread",
    "image": "https://www.bhg.com/thmb/Ytjz9QhIWrDs7RdabSJEwOEECoQ=/4000x0/filters:no_upscale():strip_icc()/bhg-recipe-breads-banana-bread-Hero-01-686d9bf4b2cf4bb3a42aaf26c98577dc.jpg",
    "description": "Classic Banana Bread is moist, tender, and packed with the natural sweetness of ripe bananas. Enhanced with a hint of vanilla and a sprinkle of cinnamon, this bread offers a comforting flavor and aroma, making it a perfect breakfast or afternoon snack.",
    "category": "Baked Goods",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1/2 cup unsalted butter, softened",
      "3/4 cup packed light brown sugar",
      "2 large eggs",
      "1 teaspoon vanilla extract",
      "3 large ripe bananas, mashed (about 1 1/2 cups)",
      "1/3 cup plain Greek yogurt or sour cream",
      "1 teaspoon ground cinnamon (optional)",
      "1/2 cup chopped nuts or chocolate chips (optional)"
    ],
    "instructions": [
      "Preheat oven to 350°F (175°C). Grease a 9x5-inch loaf pan.",
      "In a medium bowl, whisk together flour, baking soda, and salt.",
      "In a large bowl, cream together softened butter and brown sugar until light and fluffy.",
      "Beat in eggs one at a time, then stir in vanilla extract.",
      "Mix in mashed bananas and Greek yogurt or sour cream until well combined.",
      "Gradually add dry ingredients to wet ingredients, mixing until just combined.",
      "Fold in ground cinnamon and chopped nuts or chocolate chips if using.",
      "Pour batter into the prepared loaf pan, spreading evenly.",
      "Bake for 60-65 minutes, or until a toothpick inserted into the center comes out clean.",
      "Cool bread in the pan for 10 minutes, then remove from pan and transfer to a wire rack to cool completely.",
      "Slice and enjoy your homemade Classic Banana Bread!"
    ],
    "servings": 10,
    "flavors": [
      "Sweet",
      "Banana",
      "Cinnamon"
    ],
    "time": "1 hour 15 minutes",
    "best": "Warm"
  },
  {
    "id": 39,
    "name": "Clam Chowder",
    "image": "https://img.delicious.com.au/TAgP8f06/del/2015/10/fish-and-clam-chowder-14513-1.jpg",
    "description": "Clam Chowder is a creamy and flavorful soup made with tender clams, potatoes, onions, celery, and savory bacon in a rich broth thickened with cream. It has a comforting and indulgent flavors profile, perfect for warming up on chilly days or as a comforting meal. Clam Chowder can be enjoyed as a hearty starter or a satisfying main dish with crusty bread on the side.",
    "category": "Soup or Stew",
    "ingredients": [
      "4 slices bacon, diced",
      "1 onion, chopped",
      "2 celery stalks, diced",
      "2 tablespoons all-purpose flour",
      "3 cups clam juice",
      "1 cup chicken broth",
      "2 cups potatoes, peeled and diced",
      "2 cups chopped clams, fresh or canned",
      "1 cup heavy cream",
      "Salt and pepper to taste",
      "Fresh parsley for garnish"
    ],
    "instructions": [
      "In a large pot or Dutch oven, cook bacon over medium heat until crispy. Remove bacon and set aside, leaving rendered fat in the pot.",
      "Add onion and celery to the pot. Cook until softened, about 5 minutes.",
      "Stir in flour and cook for 1 minute to make a roux.",
      "Gradually whisk in clam juice and chicken broth, scraping up any browned bits from the bottom of the pot.",
      "Add diced potatoes. Bring to a boil, then reduce heat to medium-low and simmer until potatoes are tender, about 15 minutes.",
      "Stir in chopped clams, heavy cream, and cooked bacon. Simmer for an additional 5 minutes.",
      "Season with salt and pepper to taste.",
      "Serve hot, garnished with fresh parsley.",
      "Enjoy your creamy Clam Chowder!"
    ],
    "servings": 6,
    "flavors": [
      "Creamy",
      "Savory",
      "Seafood"
    ],
    "time": "40 minutes",
    "best": "Hot"
  },
  {
    "id": 10,
    "name": "Beef Stroganoff",
    "image": "https://www.supervalu.co.uk/wp-content/uploads/2018/04/beef-strog.jpg",
    "description": "Beef Stroganoff is a comforting Russian dish made with tender strips of beef, mushrooms, and onions in a creamy sour cream sauce. The beef is sautéed until browned and then simmered in a flavorful broth with onions and mushrooms until tender. The creamy sauce is made with sour cream and a hint of Dijon mustard, giving it a tangy and rich flavors. Serve Beef Stroganoff over egg noodles or rice for a satisfying meal that will warm you up on cold nights.",
    "category": "Main Dish",
    "ingredients": [
      "1 pound beef sirloin or tenderloin, thinly sliced",
      "Salt and pepper to taste",
      "2 tablespoons all-purpose flour",
      "2 tablespoons unsalted butter",
      "1 tablespoon olive oil",
      "1 onion, thinly sliced",
      "8 ounces mushrooms, sliced",
      "2 cloves garlic, minced",
      "1 cup beef broth",
      "1 tablespoon Dijon mustard",
      "1 cup sour cream",
      "2 tablespoons chopped fresh parsley"
    ],
    "instructions": [
      "Season the beef slices with salt and pepper, then dredge them in flour, shaking off any excess.",
      "In a large skillet, heat 1 tablespoon of butter and olive oil over medium-high heat. Add the beef slices and cook until browned on both sides, about 2-3 minutes per side. Remove from the skillet and set aside.",
      "In the same skillet, add the remaining butter. Add the onion and mushrooms, and sauté until they are tender and golden brown, about 5-6 minutes.",
      "Add the minced garlic and cook for another minute until fragrant.",
      "Pour in the beef broth and Dijon mustard, stirring to combine. Bring to a simmer and cook for about 10 minutes, or until the sauce has reduced slightly.",
      "Stir in the sour cream until well combined, then return the beef slices to the skillet. Cook for another 5 minutes, or until the beef is heated through and the sauce is creamy and smooth.",
      "Garnish with chopped parsley before serving. Serve the Beef Stroganoff hot over cooked egg noodles or rice.",
      "Enjoy your Beef Stroganoff!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Creamy"
    ],
    "time": "40 minutes",
    "best": "Hot"
  },
  {
    "id": 16,
    "name": "Grilled Salmon",
    "image": "https://www.thespruceeats.com/thmb/HgM2h42z1HGEcSWkWk5CgAjDDpQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/how-to-grill-salmon-2216658-hero-01-a9c948f8a238400ebaafc0caf509c7fa.jpg",
    "description": "Grilled Salmon is a simple yet elegant dish that showcases the natural flavors of fresh salmon with a smoky char from the grill. The salmon fillets are seasoned with olive oil, lemon juice, garlic, and herbs, then grilled to perfection. The result is tender and flaky salmon with a crispy skin and a hint of smokiness. Serve Grilled Salmon with a side of seasonal vegetables or a fresh salad for a healthy and delicious meal that's perfect for any occasion.",
    "category": "Main Dish",
    "ingredients": [
      "4 salmon fillets, about 6 ounces each",
      "2 tablespoons olive oil",
      "Juice of 1 lemon",
      "2 cloves garlic, minced",
      "1 teaspoon dried dill",
      "Salt and pepper to taste",
      "Lemon wedges and fresh dill sprigs for garnish"
    ],
    "instructions": [
      "Preheat the grill to medium-high heat. Brush the grill grates with oil to prevent sticking.",
      "In a small bowl, whisk together the olive oil, lemon juice, minced garlic, dried dill, salt, and pepper.",
      "Brush the salmon fillets with the olive oil mixture, ensuring they are evenly coated.",
      "Place the salmon fillets on the preheated grill, skin side down. Grill for about 4-5 minutes per side, or until the salmon is cooked through and easily flakes with a fork.",
      "Remove the salmon fillets from the grill and transfer to a serving platter.",
      "Garnish with lemon wedges and fresh dill sprigs.",
      "Serve the Grilled Salmon hot, accompanied by your favorite side dishes.",
      "Enjoy your Grilled Salmon!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Smoky",
      "Citrusy"
    ],
    "time": "15 minutes",
    "best": "Hot"
  },
  {
    "id": 38,
    "name": "Lentil Soup",
    "image": "https://www.budgetbytes.com/wp-content/uploads/2020/12/Tomato-Lentil-Soup-bowl.jpg",
    "description": "Lentil Soup is a nutritious and comforting soup made with hearty lentils, vegetables, and aromatic spices. It's a staple in many cultures due to its simplicity and nourishing qualities. Lentil Soup can be made with various types of lentils such as brown, green, or red lentils, each offering a unique texture and flavors. This wholesome soup is perfect for cold days or as a satisfying meal any time of year.",
    "category": "Soup or Stew",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 onion, chopped",
      "2 carrots, diced",
      "2 celery stalks, diced",
      "3 garlic cloves, minced",
      "1 cup dried lentils (brown or green), rinsed",
      "6 cups vegetable broth or water",
      "1 can (15 ounces) diced tomatoes",
      "1 teaspoon ground cumin",
      "1 teaspoon ground coriander",
      "1/2 teaspoon smoked paprika",
      "Salt and pepper to taste",
      "Fresh parsley for garnish"
    ],
    "instructions": [
      "In a large pot, heat olive oil over medium heat.",
      "Add onion, carrots, celery, and garlic. Cook until vegetables are softened, about 5-7 minutes.",
      "Add dried lentils, vegetable broth or water, diced tomatoes with their juices, ground cumin, ground coriander, and smoked paprika.",
      "Bring to a boil, then reduce heat to low and simmer uncovered for 30-35 minutes, or until lentils are tender.",
      "Season with salt and pepper to taste.",
      "Serve hot, garnished with fresh parsley.",
      "Enjoy your wholesome Lentil Soup!"
    ],
    "servings": 6,
    "flavors": [
      "Hearty",
      "Nutty",
      "Spiced"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 14,
    "name": "Shrimp Scampi",
    "image": "https://jennyshearawn.com/wp-content/uploads/2021/03/Shrimp-Scampi-with-Spinach-05.jpg",
    "description": "Shrimp Scampi is a classic Italian-American dish featuring succulent shrimp sautéed in garlic-infused butter, white wine, and lemon juice. The shrimp are cooked until pink and tender, then tossed with linguine pasta for a delightful seafood pasta dish. The sauce is light yet flavorful, with a hint of tanginess from the lemon and a savory richness from the butter. Garnished with fresh parsley and grated Parmesan cheese, Shrimp Scampi is quick to make and perfect for a weeknight dinner or a special occasion.",
    "category": "Main Dish",
    "ingredients": [
      "12 ounces linguine pasta",
      "1 pound large shrimp, peeled and deveined",
      "Salt and pepper to taste",
      "4 tablespoons unsalted butter",
      "4 cloves garlic, minced",
      "1/2 cup dry white wine",
      "Juice of 1 lemon",
      "1/4 teaspoon red pepper flakes (optional)",
      "2 tablespoons chopped fresh parsley",
      "Grated Parmesan cheese for serving"
    ],
    "instructions": [
      "Cook the linguine pasta in a large pot of salted boiling water according to package instructions until al dente. Reserve 1 cup of pasta cooking water, then drain the pasta.",
      "In a large skillet, melt 2 tablespoons of butter over medium heat. Add the minced garlic and cook for about 1 minute until fragrant.",
      "Add the shrimp to the skillet and season with salt and pepper. Cook the shrimp for 2-3 minutes on each side until they are pink and cooked through. Remove the shrimp from the skillet and set aside.",
      "Pour the white wine and lemon juice into the skillet, scraping up any browned bits from the bottom. Bring the mixture to a simmer and cook for about 5 minutes until slightly reduced.",
      "Stir in the remaining butter and red pepper flakes, if using. Return the shrimp to the skillet and toss to coat in the sauce.",
      "Add the cooked linguine pasta to the skillet, tossing to combine with the shrimp and sauce. If needed, add reserved pasta cooking water a little at a time to loosen the sauce.",
      "Remove the skillet from the heat and stir in chopped parsley.",
      "Serve the Shrimp Scampi hot, garnished with grated Parmesan cheese.",
      "Enjoy your Shrimp Scampi!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Buttery",
      "Citrusy"
    ],
    "time": "30 minutes",
    "best": "Warm"
  },
  {
    "id": 54,
    "name": "Fish Tacos",
    "image": "https://img.taste.com.au/ZuN3XzkF/taste/2016/11/easy-fish-tacos-106044-1.jpeg",
    "description": "Fish Tacos are a delightful dish featuring crispy fried fish fillets nestled in warm tortillas and topped with fresh slaw and creamy avocado sauce. The fish is lightly breaded and fried to golden perfection, complemented by the vibrant flavors of the toppings. Enjoy these tacos as a tasty and satisfying meal.",
    "category": "Fried or Grilled",
    "ingredients": [
      "1 lb white fish fillets (such as cod or tilapia)",
      "1 cup all-purpose flour",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "1 teaspoon paprika",
      "1/2 teaspoon garlic powder",
      "Vegetable oil, for frying",
      "8 small flour tortillas, warmed",
      "2 cups coleslaw mix (shredded cabbage and carrots)",
      "1/4 cup mayonnaise",
      "1 tablespoon fresh lime juice",
      "1 ripe avocado, sliced"
    ],
    "instructions": [
      "In a shallow dish, combine flour, salt, black pepper, paprika, and garlic powder.",
      "Dredge fish fillets in the flour mixture, shaking off excess.",
      "Heat vegetable oil in a large skillet over medium-high heat until it reaches 350°F (175°C).",
      "Fry fish fillets for 3-4 minutes per side, or until golden brown and cooked through. Drain on paper towels.",
      "In a small bowl, combine coleslaw mix, mayonnaise, and fresh lime juice. Toss to coat evenly.",
      "To assemble tacos, place a fried fish fillet in each warmed tortilla. Top with coleslaw mixture and avocado slices.",
      "Serve immediately and enjoy your homemade Fish Tacos!"
    ],
    "servings": 4,
    "flavors": [
      "Crispy",
      "Fresh",
      "Creamy"
    ],
    "time": "30 minutes",
    "best": "Hot"
  },
  {
    "id": 12,
    "name": "Thai Green Curry",
    "image": "https://www.thespruceeats.com/thmb/lRkFd-tG5HDOJQtwQHXM__6GjDw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/thai-green-curry-recipe-p3-3217442-hero-1-a3fcdfbc551849718c7750fa63ec8c6a.jpg",
    "description": "Thai Green Curry is a vibrant and aromatic Thai dish made with tender chicken, fragrant green curry paste, coconut milk, and a variety of vegetables. The curry paste is made from fresh green chilies, lemongrass, garlic, ginger, and spices, giving the dish its distinctive flavors and heat. The chicken and vegetables are simmered in the creamy coconut milk until tender, absorbing the flavors of the curry paste. Thai Green Curry is typically served over steamed jasmine rice, offering a perfect balance of spicy, sweet, and savory flavors.",
    "category": "Main Dish",
    "ingredients": [
      "1 pound boneless, skinless chicken thighs or breasts, cut into bite-sized pieces",
      "2 tablespoons Thai green curry paste",
      "1 can (14 ounces) coconut milk",
      "1 cup chicken broth",
      "1 tablespoon fish sauce",
      "1 tablespoon brown sugar",
      "1 red bell pepper, sliced",
      "1 cup broccoli florets",
      "1 carrot, sliced",
      "1 cup snap peas",
      "Fresh basil or cilantro leaves for garnish"
    ],
    "instructions": [
      "In a large skillet or wok, heat a tablespoon of vegetable oil over medium-high heat. Add the green curry paste and cook for about 1 minute until fragrant.",
      "Add the chicken pieces to the skillet and cook until they are browned on all sides, about 5-6 minutes.",
      "Pour in the coconut milk and chicken broth, stirring to combine. Bring the mixture to a simmer.",
      "Add the fish sauce and brown sugar, stirring to dissolve the sugar.",
      "Add the red bell pepper, broccoli, carrot, and snap peas to the skillet. Simmer for 10-15 minutes, or until the vegetables are tender and the chicken is cooked through.",
      "Taste and adjust seasoning with more fish sauce or sugar if needed.",
      "Serve the Thai Green Curry hot over steamed jasmine rice, garnished with fresh basil or cilantro leaves.",
      "Enjoy your Thai Green Curry!"
    ],
    "servings": 4,
    "flavors": [
      "Spicy",
      "Creamy"
    ],
    "time": "30 minutes",
    "best": "Warm"
  },
  {
    "id": 22,
    "name": "Creamy Beef Mushrooms",
    "image": "https://panlasangpinoy.com/wp-content/uploads/2023/05/creamy-beef-with-mushroom.jpg",
    "description": "Creamy Beef Mushrooms is a comforting dish made with tender beef strips cooked in a creamy mushroom and sour cream sauce. The beef is seared until browned, then simmered with onions, garlic, and mushrooms in a rich broth. Sour cream is added to the sauce, giving it a tangy and velvety texture. Creamy Beef Stroganoff is traditionally served over egg noodles or rice, making it a satisfying meal that is best enjoyed hot.",
    "category": "Main Dish",
    "ingredients": [
      "1 pound beef sirloin or tenderloin, thinly sliced",
      "Salt and pepper to taste",
      "2 tablespoons all-purpose flour",
      "2 tablespoons unsalted butter",
      "1 tablespoon olive oil",
      "1 onion, thinly sliced",
      "8 ounces mushrooms, sliced",
      "2 cloves garlic, minced",
      "1 cup beef broth",
      "1 tablespoon Dijon mustard",
      "1 cup sour cream",
      "2 tablespoons chopped fresh parsley"
    ],
    "instructions": [
      "Season the beef slices with salt and pepper, then dredge them in flour, shaking off any excess.",
      "In a large skillet, heat 1 tablespoon of butter and olive oil over medium-high heat. Add the beef slices and cook until browned on both sides, about 2-3 minutes per side. Remove the beef from the skillet and set aside.",
      "In the same skillet, add the remaining tablespoon of butter. Add the sliced onions and cook until softened, about 5 minutes.",
      "Add the mushrooms and garlic to the skillet. Cook until the mushrooms are golden brown and any liquid has evaporated, about 5-7 minutes.",
      "Pour in the beef broth and Dijon mustard. Bring to a simmer and cook for 5 minutes, stirring occasionally.",
      "Reduce the heat to low. Stir in the sour cream until the sauce is smooth and creamy.",
      "Return the beef slices to the skillet and simmer for another 5 minutes, or until the beef is heated through and tender.",
      "Season with salt and pepper to taste.",
      "Serve the Creamy Beef Stroganoff hot over cooked egg noodles or rice, garnished with chopped parsley.",
      "Enjoy your Creamy Beef Stroganoff!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Creamy",
      "Rich"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 31,
    "name": "Fresh Mint Lemonade",
    "image": "https://xoxobella.com/wp-content/uploads/2021/08/frozen_mint_lemonade_refreshing_limonana_bella_bucchiotti_7.jpg",
    "description": "Fresh Mint Lemonade is a refreshing beverage made with freshly squeezed lemon juice, mint leaves, sugar, and cold water. It's a simple yet invigorating drink that balances the tartness of lemons with the cooling essence of mint. Fresh Mint Lemonade is best enjoyed ice-cold, making it a perfect thirst-quencher on hot summer days or a zesty accompaniment to outdoor gatherings. Customize the sweetness to your preference and garnish with extra mint leaves for a delightful presentation.",
    "category": "Beverage",
    "ingredients": [
      "1 cup freshly squeezed lemon juice",
      "1/2 cup sugar",
      "2 cups cold water",
      "1/4 cup fresh mint leaves, plus extra for garnish",
      "Ice cubes"
    ],
    "instructions": [
      "In a small saucepan, combine sugar and 1 cup of water. Heat over medium heat, stirring occasionally, until sugar is completely dissolved to make a simple syrup. Remove from heat and let cool.",
      "In a pitcher, combine freshly squeezed lemon juice, simple syrup, cold water, and fresh mint leaves.",
      "Stir well to combine and refrigerate for at least 1 hour to allow flavors to meld.",
      "Strain out mint leaves if desired, or leave them for extra flavors.",
      "Serve over ice, garnished with fresh mint leaves.",
      "Enjoy your refreshing Fresh Mint Lemonade!"
    ],
    "servings": 4,
    "flavors": [
      "Citrusy",
      "Refreshing",
      "Minty"
    ],
    "time": "10 minutes",
    "best": "Cold"
  },
  {
    "id": 41,
    "name": "Butternut Squash Soup",
    "image": "https://assets.epicurious.com/photos/64e3dc5e2b2b52d7cfe90da8/16:9/w_5482,h_3084,c_limit/Butternut-Squash-Soup_Recipe_081723_1599.jpg",
    "description": "Butternut Squash Soup is a creamy and velvety soup made with roasted butternut squash, onions, garlic, and warming spices like nutmeg and cinnamon. It has a rich and slightly sweet flavors profile, perfect for autumn or winter days. This comforting soup is blended until smooth, creating a luxurious texture that warms you from the inside out.",
    "category": "Soup or Stew",
    "ingredients": [
      "1 large butternut squash, peeled, seeded, and cubed",
      "2 tablespoons olive oil",
      "1 onion, chopped",
      "2 garlic cloves, minced",
      "4 cups vegetable broth",
      "1/2 teaspoon ground nutmeg",
      "1/2 teaspoon ground cinnamon",
      "Salt and pepper to taste",
      "1/2 cup heavy cream (optional)",
      "Toasted pumpkin seeds for garnish"
    ],
    "instructions": [
      "Preheat oven to 400°F (200°C).",
      "Toss cubed butternut squash with olive oil, salt, and pepper. Spread on a baking sheet in a single layer.",
      "Roast squash until tender and caramelized, about 30-40 minutes, stirring halfway through.",
      "In a large pot, heat olive oil over medium heat. Add chopped onion and cook until softened, about 5 minutes.",
      "Add minced garlic and cook for 1 minute until fragrant.",
      "Add roasted butternut squash, vegetable broth, ground nutmeg, and ground cinnamon. Bring to a boil, then reduce heat and simmer for 15 minutes.",
      "Using an immersion blender or regular blender, blend soup until smooth and creamy.",
      "Stir in heavy cream if using. Season with salt and pepper to taste.",
      "Serve hot, garnished with toasted pumpkin seeds.",
      "Enjoy your velvety Butternut Squash Soup!"
    ],
    "servings": 6,
    "flavors": [
      "Creamy",
      "Sweet",
      "Spiced"
    ],
    "time": "1 hour",
    "best": "Hot"
  },
  {
    "id": 18,
    "name": "Chicken Adobo",
    "image": "https://cdn.shortpixel.ai/client/q_lossy,ret_img,w_2000/https://norecipes.com/wp-content/uploads/2017/12/chicken-adobo_008.jpg",
    "description": "Chicken Adobo is a classic Filipino dish known for its savory and tangy flavors. Chicken pieces are simmered in a marinade of soy sauce, vinegar, garlic, and black peppercorns until tender. The cooking process allows the flavors to meld together, creating a rich and comforting dish that is typically served with steamed rice. Chicken Adobo is beloved for its versatility and ability to be enjoyed hot or cold, making it a staple in Filipino cuisine.",
    "category": "Main Dish",
    "ingredients": [
      "2 pounds chicken thighs and drumsticks",
      "1/2 cup soy sauce",
      "1/2 cup vinegar (cane or white)",
      "1 cup water",
      "1 onion, sliced",
      "4 cloves garlic, minced",
      "1 teaspoon whole black peppercorns",
      "2 bay leaves",
      "1 tablespoon cooking oil",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "In a large bowl or container, combine the chicken pieces with soy sauce, vinegar, garlic, black peppercorns, and bay leaves. Marinate the chicken for at least 30 minutes, or preferably overnight in the refrigerator.",
      "In a large pot or Dutch oven, heat the cooking oil over medium-high heat. Remove the chicken pieces from the marinade, reserving the marinade.",
      "Sear the chicken pieces until browned on both sides, about 3-4 minutes per side.",
      "Add the sliced onions and cook until softened, about 3 minutes.",
      "Pour in the reserved marinade and water. Bring to a boil, then reduce the heat to low, cover, and simmer for 30-40 minutes or until the chicken is tender and cooked through.",
      "Season with salt and pepper to taste. Serve hot with steamed rice.",
      "Enjoy your Chicken Adobo!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Tangy",
      "Umami"
    ],
    "time": "1 hour",
    "best": "Hot"
  },
  {
    "id": 26,
    "name": "Espresso Martini",
    "image": "https://realfood.tesco.com/media/images/1400x919-espresso-martini-2d0ffa8b-890e-4965-a204-4458bf350ee8-0-1400x919.jpg",
    "description": "Espresso Martini is a sophisticated cocktail that blends the richness of espresso with the smoothness of vodka and sweetness of coffee liqueur. It's shaken with ice to create a frothy texture and served in a martini glass, often garnished with coffee beans. This cocktail offers a perfect balance of bitter, sweet, and boozy notes, making it an ideal after-dinner drink or a pick-me-up during social gatherings.",
    "category": "Beverage",
    "ingredients": [
      "1 1/2 ounces vodka",
      "1 ounce coffee liqueur (e.g., Kahlúa)",
      "1 ounce freshly brewed espresso, chilled",
      "1/2 ounce simple syrup (optional, if sweeter taste desired)",
      "Ice cubes",
      "Coffee beans for garnish"
    ],
    "instructions": [
      "Fill a cocktail shaker with ice cubes.",
      "Add vodka, coffee liqueur, and chilled espresso.",
      "Add simple syrup if desired for a sweeter taste.",
      "Shake vigorously until well-chilled and frothy.",
      "Strain into a chilled martini glass.",
      "Garnish with coffee beans.",
      "Serve immediately and enjoy your Espresso Martini!"
    ],
    "servings": 1,
    "flavors": [
      "Bold",
      "Coffee",
      "Sweet"
    ],
    "time": "5 minutes",
    "best": "Cold"
  },
  {
    "id": 9,
    "name": "Chicken Marsala",
    "image": "https://img.hellofresh.com/f_auto,fl_lossy,q_auto,w_1200/hellofresh_s3/image/chicken-marsala-80822e04.jpg",
    "description": "Chicken Marsala is a classic Italian-American dish featuring tender chicken breasts smothered in a rich mushroom and Marsala wine sauce. The chicken is lightly dredged in flour and sautéed to golden perfection, then simmered in a savory sauce made with Marsala wine, mushrooms, garlic, and herbs. The result is a dish that is both hearty and flavorful, with a perfect balance of sweet and savory notes. Serve this elegant dish over pasta or with mashed potatoes for a comforting and satisfying meal.",
    "category": "Main Dish",
    "ingredients": [
      "4 boneless, skinless chicken breasts",
      "1/2 cup all-purpose flour",
      "Salt and pepper to taste",
      "4 tablespoons unsalted butter",
      "2 tablespoons olive oil",
      "1 cup sliced mushrooms",
      "2 cloves garlic, minced",
      "1 cup Marsala wine",
      "1 cup chicken broth",
      "1/2 cup heavy cream",
      "2 tablespoons chopped fresh parsley"
    ],
    "instructions": [
      "Season the chicken breasts with salt and pepper, then dredge them in flour, shaking off any excess.",
      "In a large skillet, heat 2 tablespoons of butter and 1 tablespoon of olive oil over medium-high heat. Add the chicken breasts and cook until golden brown on both sides and cooked through, about 5-6 minutes per side. Remove from the skillet and set aside.",
      "In the same skillet, add the remaining butter and olive oil. Add the mushrooms and sauté until they are golden brown and tender, about 5 minutes.",
      "Add the minced garlic and cook for another minute until fragrant.",
      "Pour in the Marsala wine and chicken broth, scraping up any browned bits from the bottom of the skillet. Bring to a simmer and cook for about 10 minutes, or until the sauce has reduced by half.",
      "Stir in the heavy cream and return the chicken breasts to the skillet. Simmer for another 5 minutes, or until the chicken is heated through and the sauce has thickened.",
      "Garnish with chopped parsley before serving. Serve the Chicken Marsala hot over cooked pasta or with mashed potatoes.",
      "Enjoy your Chicken Marsala!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Umami"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 72,
    "name": "Mediterranean Quinoa Salad",
    "image": "https://sumptuousliving.net/wp-content/uploads/2016/07/mediterranean-quinoa-salad-4.jpg",
    "description": "Mediterranean Quinoa Salad is a nutritious and satisfying salad featuring fluffy quinoa tossed with fresh vegetables, chickpeas, olives, and feta cheese in a tangy lemon herb dressing. This salad is packed with protein and flavor, making it a perfect choice for a light lunch or side dish. Enjoy Mediterranean Quinoa Salad as a refreshing and wholesome addition to your meal.",
    "category": "Salad",
    "ingredients": [
      "1 cup quinoa, cooked and cooled",
      "1 cucumber, diced",
      "1 red bell pepper, diced",
      "1 cup cherry tomatoes, halved",
      "1/2 cup Kalamata olives, sliced",
      "1/2 cup crumbled feta cheese",
      "1/4 cup chopped fresh parsley",
      "1/4 cup extra virgin olive oil",
      "2 tablespoons fresh lemon juice",
      "1 teaspoon dried oregano",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a large salad bowl, combine cooked and cooled quinoa, diced cucumber, diced red bell pepper, halved cherry tomatoes, sliced Kalamata olives, crumbled feta cheese, and chopped fresh parsley.",
      "In a small bowl, whisk together extra virgin olive oil, fresh lemon juice, dried oregano, salt, and black pepper to make the dressing.",
      "Pour the dressing over the salad ingredients and toss gently to coat evenly.",
      "Serve Mediterranean Quinoa Salad immediately as a nutritious and flavorful side dish or light lunch.",
      "Enjoy your homemade Mediterranean Quinoa Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Fresh",
      "Tangy",
      "Herbaceous"
    ],
    "time": "20 minutes",
    "best": "Cold"
  },
  {
    "id": 53,
    "name": "Grilled Salmon",
    "image": "https://hips.hearstapps.com/hmg-prod/images/how-to-grill-salmon-recipe1-1655870645.jpg?crop=0.8888888888888888xw:1xh;center,top&resize=1200:*",
    "description": "Grilled Salmon is a healthy and flavorful dish featuring tender, flaky salmon fillets marinated in a tangy lemon herb sauce. The salmon is grilled to perfection, imparting a smoky flavor while retaining its natural juices. Serve with a side of vegetables or over a bed of rice for a nutritious and satisfying meal.",
    "category": "Fried or Grilled",
    "ingredients": [
      "4 salmon fillets, skin-on",
      "1/4 cup olive oil",
      "2 tablespoons fresh lemon juice",
      "2 cloves garlic, minced",
      "1 teaspoon fresh thyme, chopped",
      "1 teaspoon fresh rosemary, chopped",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a shallow dish, whisk together olive oil, lemon juice, minced garlic, chopped thyme, chopped rosemary, salt, and black pepper.",
      "Add salmon fillets to the marinade, turning to coat evenly. Cover and refrigerate for at least 30 minutes, up to 2 hours.",
      "Preheat grill to medium-high heat. Brush grill grates lightly with oil to prevent sticking.",
      "Remove salmon from marinade, shaking off excess, and place skin-side down on the grill.",
      "Grill salmon for 4-5 minutes per side, or until fish flakes easily with a fork and internal temperature reaches 145°F (63°C).",
      "Transfer grilled salmon to a serving platter and garnish with additional herbs if desired.",
      "Serve hot and enjoy your homemade Grilled Salmon!"
    ],
    "servings": 4,
    "flavors": [
      "Smoky",
      "Citrusy",
      "Herb-infused"
    ],
    "time": "40 minutes",
    "best": "Hot"
  },
  {
    "id": 34,
    "name": "Chicken Noodle Soup",
    "image": "https://myheartbeets.com/wp-content/uploads/2020/12/easy-chicken-noodle-soup.jpg",
    "description": "Chicken Noodle Soup is a comforting and hearty soup made with tender chicken, vegetables, egg noodles, and aromatic herbs. It's simmered to perfection in a flavorful chicken broth that warms you from the inside out. This classic soup is perfect for cold days or when you need a soothing meal to lift your spirits.",
    "category": "Soup or Stew",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 onion, chopped",
      "2 carrots, sliced",
      "2 celery stalks, sliced",
      "2 garlic cloves, minced",
      "8 cups chicken broth",
      "2 cups shredded cooked chicken",
      "2 cups egg noodles",
      "1 teaspoon dried thyme",
      "Salt and pepper to taste",
      "Fresh parsley for garnish"
    ],
    "instructions": [
      "In a large pot, heat olive oil over medium heat. Add onion, carrots, and celery. Cook until softened, about 5 minutes.",
      "Add garlic and cook for 1 minute until fragrant.",
      "Pour in chicken broth and bring to a boil.",
      "Add shredded chicken, egg noodles, and dried thyme. Simmer until noodles are tender, about 10 minutes.",
      "Season with salt and pepper to taste.",
      "Serve hot, garnished with fresh parsley.",
      "Enjoy your comforting Chicken Noodle Soup!"
    ],
    "servings": 6,
    "flavors": [
      "Warm",
      "Comforting",
      "Savory"
    ],
    "time": "30 minutes",
    "best": "Hot"
  },
  {
    "id": 15,
    "name": "Vegetable Stir-Fry",
    "image": "https://playswellwithbutter.com/wp-content/uploads/2022/02/Beef-and-Vegetable-Stir-Fry-16.jpg",
    "description": "Vegetable Stir-Fry is a quick and colorful dish featuring a variety of fresh vegetables stir-fried in a savory sauce. The vegetables are cooked until tender-crisp, preserving their vibrant colors and natural flavors. The sauce is made with soy sauce, ginger, garlic, and a touch of honey, creating a perfect balance of salty, sweet, and savory notes. Serve Vegetable Stir-Fry over steamed rice or noodles for a healthy and satisfying vegetarian meal that can be customized with your favorite vegetables.",
    "category": "Main Dish",
    "ingredients": [
      "2 cups broccoli florets",
      "1 red bell pepper, thinly sliced",
      "1 yellow bell pepper, thinly sliced",
      "1 carrot, thinly sliced",
      "1 cup snap peas",
      "1 cup sliced mushrooms",
      "3 tablespoons vegetable oil",
      "3 cloves garlic, minced",
      "1 tablespoon grated fresh ginger",
      "1/4 cup soy sauce",
      "2 tablespoons hoisin sauce",
      "1 tablespoon honey",
      "2 teaspoons cornstarch dissolved in 1/4 cup water",
      "Sesame seeds and sliced green onions for garnish"
    ],
    "instructions": [
      "In a small bowl, whisk together the soy sauce, hoisin sauce, honey, and cornstarch mixture. Set aside.",
      "Heat 2 tablespoons of vegetable oil in a large skillet or wok over medium-high heat. Add the minced garlic and grated ginger, and cook for about 30 seconds until fragrant.",
      "Add the broccoli, bell peppers, carrot, snap peas, and mushrooms to the skillet. Stir-fry for 4-5 minutes, or until the vegetables are tender-crisp.",
      "Pour the sauce mixture over the vegetables in the skillet. Stir-fry for another 2-3 minutes, or until the sauce has thickened and coats the vegetables.",
      "Remove the skillet from the heat and garnish with sesame seeds and sliced green onions.",
      "Serve the Vegetable Stir-Fry hot over steamed rice or noodles.",
      "Enjoy your Vegetable Stir-Fry!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Sweet",
      "Umami"
    ],
    "time": "20 minutes",
    "best": "Warm"
  },
  {
    "id": 5,
    "name": "Apple Pie",
    "image": "https://www.southernliving.com/thmb/bbDY1d_ySIrCFcq8WNBkR-3x6pU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2589601_Mailb_Mailbox_Apple_Pie_003-da802ff7a8984b2fa9aa0535997ab246.jpg",
    "description": "Traditional apple pie with a flaky, buttery crust and a spiced apple filling. This classic dessert embodies the warmth and comfort of homemade baking. The tender apples are delicately spiced with cinnamon and nutmeg, enveloped in a buttery, golden crust that melts in your mouth. Each slice offers a perfect balance of sweet and tart flavorss, making it a beloved dessert for gatherings and holidays. Serve warm with a scoop of vanilla ice cream for a truly nostalgic experience.",
    "category": "Dessert",
    "ingredients": [
      "2 1/2 cups all-purpose flour",
      "1 cup unsalted butter, chilled and cut into small pieces",
      "1/2 teaspoon salt",
      "1/4 cup ice water",
      "6 cups thinly sliced apples",
      "3/4 cup granulated sugar",
      "1/4 cup packed brown sugar",
      "1 teaspoon ground cinnamon",
      "1/4 teaspoon ground nutmeg",
      "1 tablespoon lemon juice",
      "1 tablespoon all-purpose flour"
    ],
    "instructions": [
      "Preheat the oven to 425°F (220°C).",
      "In a large bowl, mix flour and salt. Cut in butter until mixture resembles coarse crumbs. Stir in water, a tablespoon at a time, until mixture forms a ball. Divide dough in half and shape into discs. Wrap in plastic and refrigerate for at least 4 hours or overnight.",
      "Roll out one disc on a lightly floured surface to fit a 9-inch pie plate. Place crust in pie plate. Roll out the second disc to cover the pie.",
      "In a large bowl, combine apples, sugars, cinnamon, nutmeg, lemon juice, and flour. Pour into crust-lined pie plate. Dot with butter.",
      "Cover with the top crust, trim excess dough, and seal edges. Cut several slits in the top crust to allow steam to escape.",
      "Bake for 45 to 50 minutes, or until crust is golden brown and filling is bubbly.",
      "Cool on a wire rack before serving."
    ],
    "servings": 8,
    "flavors": [
      "Sweet"
    ],
    "time": "5 hours",
    "best": "Cold"
  },
  {
    "id": 3,
    "name": "New York Cheesecake",
    "image": "https://www.thespruceeats.com/thmb/HM3X8w38eMVo0Lejx4GLvGHZ4dM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gluten-free-new-york-cheesecake-1450985-hero-01-dc54f9daf38044238b495c7cefc191fa.jpg",
    "description": "Rich and creamy New York-style cheesecake with a graham cracker crust. This dessert is renowned for its dense, smooth texture and its perfectly balanced flavors profile that is neither too sweet nor too tangy. The velvety cream cheese filling is complemented by a hint of vanilla, while the buttery graham cracker crust adds a delightful crunch. Whether topped with fresh berries or enjoyed plain, each bite melts in your mouth, making it an ideal choice for special occasions or casual gatherings.",
    "category": "Dessert",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup melted butter",
      "1 tablespoon granulated sugar",
      "4 (8 ounce) packages cream cheese, softened",
      "1 cup granulated sugar",
      "1 teaspoon vanilla extract",
      "4 large eggs",
      "1 cup sour cream",
      "1/4 cup all-purpose flour"
    ],
    "instructions": [
      "Preheat the oven to 325°F (165°C).",
      "In a medium bowl, mix together the graham cracker crumbs, melted butter, and 1 tablespoon sugar. Press into the bottom of a 9-inch springform pan.",
      "In a large bowl, mix the cream cheese with 1 cup sugar until smooth. Blend in the vanilla.",
      "Add the eggs one at a time, mixing just enough to incorporate.",
      "Blend in the sour cream and flour until smooth. Pour the filling into the crust.",
      "Bake for 1 hour in the preheated oven, or until the center is set.",
      "Turn off the oven, and let the cheesecake cool in the oven with the door closed for 5 to 6 hours; this prevents cracking.",
      "Chill in the refrigerator until serving."
    ],
    "servings": 12,
    "flavors": [
      "Sweet"
    ],
    "time": "7 hours and 30 minutes",
    "best": "Cold"
  },
  {
    "id": 60,
    "name": "Fried Dumplings (Potstickers)",
    "image": "https://www.thespruceeats.com/thmb/tCavCIuQ9ab97ZR5iT7keBf3pbM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/chinese-pan-fried-dumplings-694499-hero-01-f51eb10e369d47bea2d8809300bbe83a.jpg",
    "description": "Fried Dumplings, also known as Potstickers, are savory dumplings filled with a mixture of ground meat and vegetables, pan-fried until crispy on the bottom and steamed to perfection. These dumplings are served with a dipping sauce made of soy sauce, vinegar, and sesame oil. Enjoy them as a delightful appetizer or main dish.",
    "category": "Fried or Grilled",
    "ingredients": [
      "1 lb ground pork or chicken",
      "2 cups finely chopped cabbage",
      "2 green onions, finely chopped",
      "2 cloves garlic, minced",
      "1 tablespoon soy sauce",
      "1 tablespoon oyster sauce",
      "1 teaspoon sesame oil",
      "1/2 teaspoon black pepper",
      "1 package round dumpling wrappers",
      "Vegetable oil, for frying",
      "1/2 cup water, for steaming"
    ],
    "instructions": [
      "In a large bowl, combine ground pork or chicken, chopped cabbage, green onions, minced garlic, soy sauce, oyster sauce, sesame oil, and black pepper.",
      "Place a spoonful of filling in the center of each dumpling wrapper. Moisten edges with water and fold over, pressing to seal into a half-moon shape.",
      "Heat vegetable oil in a large skillet over medium heat. Arrange dumplings in a single layer, flat side down.",
      "Cook dumplings for 2-3 minutes until bottoms are golden brown.",
      "Carefully add 1/2 cup of water to the skillet and immediately cover with a lid. Steam dumplings for 6-8 minutes until filling is cooked through.",
      "Remove lid and continue cooking until water evaporates and bottoms of dumplings are crispy again.",
      "Transfer fried dumplings to a serving platter and serve hot with dipping sauce.",
      "Enjoy your homemade Fried Dumplings (Potstickers)!"
    ],
    "servings": 4,
    "flavors": [
      "Crispy",
      "Savory",
      "Umami"
    ],
    "time": "1 hour",
    "best": "Hot"
  },
  {
    "id": 11,
    "name": "Spaghetti Carbonara",
    "image": "https://www.marthastewart.com/thmb/o-mAIZU-NaYlbnupR8mKQhlkY7U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/MSL-341240-Quick-Carbonara-hero-3x2-6889-8c65cdf67f1149189b492c4def3c02e5.jpeg",
    "description": "Spaghetti Carbonara is a traditional Italian pasta dish made with spaghetti, eggs, Parmesan cheese, pancetta, and black pepper. The hot pasta is tossed with a creamy sauce made from eggs, cheese, and pancetta fat, creating a velvety coating that clings to each strand of pasta. The dish is finished with a generous sprinkle of freshly cracked black pepper, adding a bold and aromatic flavors. Spaghetti Carbonara is quick to make yet full of comforting flavors, making it a favorite for weeknight dinners or special occasions.",
    "category": "Main Dish",
    "ingredients": [
      "12 ounces spaghetti",
      "4 ounces pancetta or bacon, diced",
      "3 large eggs",
      "1 cup grated Parmesan cheese, plus extra for serving",
      "1/2 teaspoon freshly ground black pepper",
      "Salt to taste",
      "2 tablespoons chopped fresh parsley"
    ],
    "instructions": [
      "Cook the spaghetti in a large pot of salted boiling water according to package instructions until al dente. Reserve 1 cup of pasta cooking water, then drain the spaghetti.",
      "In a large skillet, cook the diced pancetta over medium heat until crispy and golden brown, about 5-6 minutes. Remove the pancetta with a slotted spoon and set aside, leaving the rendered fat in the skillet.",
      "In a bowl, whisk together the eggs, grated Parmesan cheese, black pepper, and a pinch of salt.",
      "Add the drained spaghetti to the skillet with the pancetta fat, tossing to coat the pasta in the fat.",
      "Remove the skillet from the heat and quickly pour the egg and cheese mixture over the hot spaghetti, tossing continuously to coat the pasta evenly. The residual heat from the pasta will cook the eggs, creating a creamy sauce.",
      "If needed, add reserved pasta cooking water, a little at a time, to loosen the sauce to your desired consistency.",
      "Stir in the crispy pancetta. Taste and adjust seasoning with salt and pepper as needed.",
      "Garnish with chopped parsley and additional grated Parmesan cheese before serving. Serve the Spaghetti Carbonara immediately.",
      "Enjoy your Spaghetti Carbonara!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Creamy"
    ],
    "time": "25 minutes",
    "best": "Warm"
  },
  {
    "id": 56,
    "name": "Grilled BBQ Ribs",
    "image": "https://www.harryanddavid.com/blog/wp-content/uploads/2021/07/how-to-grill-ribs.jpg",
    "description": "Grilled BBQ Ribs are tender and flavorful ribs coated in a smoky barbecue sauce and grilled to perfection. These ribs are marinated in a savory rub, slow-cooked until tender, and then finished on the grill for a caramelized crust. Enjoy them with your favorite sides for a delicious barbecue experience.",
    "category": "Fried or Grilled",
    "ingredients": [
      "2 racks pork baby back ribs",
      "1/4 cup brown sugar",
      "2 tablespoons paprika",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "1 tablespoon salt",
      "1 tablespoon black pepper",
      "2 cups barbecue sauce, divided"
    ],
    "instructions": [
      "In a small bowl, combine brown sugar, paprika, garlic powder, onion powder, salt, and black pepper to make the dry rub.",
      "Remove membrane from the back of the ribs and rub dry rub mixture all over both sides of the ribs.",
      "Wrap ribs tightly in plastic wrap and refrigerate for at least 4 hours, preferably overnight, to marinate.",
      "Preheat grill to medium-high heat. Brush grill grates with oil to prevent sticking.",
      "Place ribs on the grill, bone-side down, and cook covered for 20-25 minutes, turning occasionally.",
      "Brush ribs generously with barbecue sauce, turning and basting every few minutes, until caramelized and cooked through.",
      "Remove ribs from grill and let rest for 5 minutes before slicing and serving.",
      "Enjoy your homemade Grilled BBQ Ribs!"
    ],
    "servings": 4,
    "flavors": [
      "Smoky",
      "Sweet",
      "Tangy"
    ],
    "time": "5 hours",
    "best": "Hot"
  },
  {
    "id": 19,
    "name": "Sinigang na Baboy",
    "image": "https://assets.unileversolutions.com/recipes-v2/214408.png",
    "description": "Sinigang na Baboy is a traditional Filipino sour soup made with pork ribs, tamarind broth, and a variety of vegetables. The tartness of tamarind provides a distinctive sour flavors that balances the richness of the pork and the sweetness of the vegetables. Commonly included vegetables are radish, eggplant, string beans, and water spinach (kangkong). Sinigang is typically enjoyed hot, served over steamed rice, and is a popular comfort food in the Philippines, especially during rainy seasons.",
    "category": "Main Dish",
    "ingredients": [
      "1 pound pork ribs, cut into serving pieces",
      "1 medium onion, quartered",
      "2 tomatoes, quartered",
      "2 tablespoons tamarind paste or 1 packet sinigang mix",
      "8 cups water",
      "1 radish, sliced",
      "1 eggplant, sliced",
      "1 cup string beans, cut into 2-inch pieces",
      "2 cups water spinach (kangkong), or spinach leaves",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "In a large pot, bring water to a boil over medium-high heat.",
      "Add the pork ribs, onion, and tomatoes. Simmer for 1 hour or until the pork is tender.",
      "Dilute the tamarind paste in 1 cup of water. Strain and add the tamarind juice to the pot.",
      "Add the radish and eggplant to the pot and cook for 5 minutes.",
      "Add the string beans and water spinach. Cook for another 5 minutes or until all vegetables are tender.",
      "Season with salt and pepper to taste.",
      "Serve hot with steamed rice.",
      "Enjoy your Sinigang na Baboy!"
    ],
    "servings": 6,
    "flavors": [
      "Sour",
      "Savory",
      "Umami"
    ],
    "time": "1 hour and 30 minutes",
    "best": "Hot"
  },
  {
    "id": 32,
    "name": "Spiced Chai Tea Latte",
    "image": "https://capital-brands-llc.imgix.net/recipe-r2650-spiced-pumpkin-chai-latte-fullsize-185031.jpg",
    "description": "Spiced Chai Tea Latte is a comforting and aromatic beverage made with black tea, spices, milk, and sweetener. It's infused with warming spices such as cinnamon, cardamom, ginger, cloves, and black pepper, giving it a complex and cozy flavors profile. Chai tea is brewed with milk and sweetened to taste, then served hot for a soothing and flavorful drink. Spiced Chai Tea Latte is perfect for chilly mornings or as a pick-me-up during the day.",
    "category": "Beverage",
    "ingredients": [
      "2 cups water",
      "2 black tea bags (or loose black tea)",
      "1 cup milk",
      "2 tablespoons honey or sugar",
      "1 cinnamon stick",
      "4 whole cloves",
      "4 cardamom pods, lightly crushed",
      "1 slice fresh ginger",
      "Pinch of black pepper",
      "Whipped cream and ground cinnamon for garnish (optional)"
    ],
    "instructions": [
      "In a small saucepan, bring water to a boil.",
      "Remove from heat and add black tea bags, cinnamon stick, cloves, cardamom pods, ginger slice, and black pepper.",
      "Cover and steep for 5 minutes to infuse the spices into the tea.",
      "Add milk and honey or sugar to the tea mixture.",
      "Heat over medium heat until hot but not boiling, stirring occasionally.",
      "Strain tea mixture into mugs and discard the spices.",
      "Garnish with whipped cream and a sprinkle of ground cinnamon if desired.",
      "Serve hot and enjoy your Spiced Chai Tea Latte!"
    ],
    "servings": 2,
    "flavors": [
      "Spicy",
      "Warm",
      "Aromatic"
    ],
    "time": "15 minutes",
    "best": "Hot"
  },
  {
    "id": 71,
    "name": "Thai Beef Salad",
    "image": "https://img.taste.com.au/ICT5K7H3/taste/2016/11/thai-beef-salad_1980x1320-118406-1.jpg",
    "description": "Thai Beef Salad, also known as 'Yam Nua', is a vibrant and flavorful salad featuring tender slices of grilled beef tossed with fresh herbs, cucumber, tomatoes, and red onions in a tangy lime dressing. The salad is garnished with roasted peanuts and cilantro, adding crunch and depth of flavor. Enjoy Thai Beef Salad as a main course for a satisfying and exotic meal.",
    "category": "Salad",
    "ingredients": [
      "1 lb beef sirloin steak, grilled and thinly sliced",
      "4 cups mixed salad greens",
      "1 cucumber, thinly sliced",
      "2 tomatoes, cut into wedges",
      "1/2 red onion, thinly sliced",
      "1/4 cup fresh cilantro leaves",
      "1/4 cup roasted peanuts, chopped",
      "1/4 cup fish sauce",
      "2 tablespoons fresh lime juice",
      "1 tablespoon brown sugar",
      "1 garlic clove, minced",
      "1 red chili, thinly sliced (optional)"
    ],
    "instructions": [
      "In a large salad bowl, combine grilled beef slices, mixed salad greens, thinly sliced cucumber, tomato wedges, thinly sliced red onion, fresh cilantro leaves, and chopped roasted peanuts.",
      "In a small bowl, whisk together fish sauce, fresh lime juice, brown sugar, minced garlic, and thinly sliced red chili (if using) to make the dressing.",
      "Pour the dressing over the salad and toss gently to combine all the ingredients.",
      "Serve Thai Beef Salad immediately as a main course, garnished with additional cilantro leaves and peanuts if desired.",
      "Enjoy your homemade Thai Beef Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Tangy",
      "Savory",
      "Herbaceous"
    ],
    "time": "30 minutes",
    "best": "Cold"
  },
  {
    "id": 65,
    "name": "Grilled Shrimp Skewers",
    "image": "https://hips.hearstapps.com/hmg-prod/images/grilled-shrimp-skewers-recipe-1620337277.jpg?crop=1xw:0.8434864104967198xh;center,top&resize=1200:*",
    "description": "Grilled Shrimp Skewers are succulent shrimp marinated in a tangy lemon garlic marinade and grilled to perfection. These skewers are quick and easy to prepare, perfect for a light and flavorful meal or appetizer. Serve these grilled shrimp skewers with a fresh salad or over rice for a deliciously satisfying dish.",
    "category": "Seafood",
    "ingredients": [
      "1 lb large shrimp, peeled and deveined",
      "1/4 cup olive oil",
      "2 tablespoons fresh lemon juice",
      "2 cloves garlic, minced",
      "1 teaspoon dried oregano",
      "1/2 teaspoon paprika",
      "Salt and black pepper, to taste",
      "Wooden skewers, soaked in water"
    ],
    "instructions": [
      "In a bowl, whisk together olive oil, fresh lemon juice, minced garlic, dried oregano, paprika, salt, and black pepper.",
      "Add shrimp to the marinade, tossing to coat evenly. Cover and refrigerate for at least 30 minutes, up to 1 hour.",
      "Preheat grill to medium-high heat. Thread marinated shrimp onto soaked wooden skewers.",
      "Grill shrimp skewers for 2-3 minutes per side, or until shrimp are pink and opaque.",
      "Transfer grilled shrimp skewers to a serving platter and garnish with lemon wedges.",
      "Serve hot and enjoy your homemade Grilled Shrimp Skewers!"
    ],
    "servings": 4,
    "flavors": [
      "Tangy",
      "Garlicky",
      "Herb-infused"
    ],
    "time": "30 minutes",
    "best": "Hot"
  },
  {
    "id": 73,
    "name": "Asian Sesame Chicken Salad",
    "image": "https://foolproofliving.com/wp-content/uploads/2017/05/Asian-Sesame-Chicken-Salad-Recipe-Image.jpg",
    "description": "Asian Sesame Chicken Salad is a vibrant salad featuring tender chicken breast strips marinated in a sesame soy dressing, served with crisp lettuce, crunchy cabbage, carrots, bell peppers, and toasted sesame seeds. Tossed in a tangy ginger vinaigrette, this salad is packed with Asian-inspired flavors and textures. Enjoy it as a satisfying and wholesome meal.",
    "category": "Salad",
    "ingredients": [
      "1 lb chicken breast, grilled and thinly sliced",
      "4 cups mixed salad greens",
      "1 cup shredded cabbage",
      "1 carrot, julienned",
      "1 bell pepper, thinly sliced",
      "2 green onions, thinly sliced",
      "2 tablespoons toasted sesame seeds",
      "1/4 cup soy sauce",
      "2 tablespoons sesame oil",
      "2 tablespoons rice vinegar",
      "1 tablespoon honey",
      "1 teaspoon grated ginger",
      "1 garlic clove, minced",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a large salad bowl, combine grilled and thinly sliced chicken breast, mixed salad greens, shredded cabbage, julienned carrot, thinly sliced bell pepper, green onions, and toasted sesame seeds.",
      "In a small bowl, whisk together soy sauce, sesame oil, rice vinegar, honey, grated ginger, minced garlic, salt, and black pepper to make the dressing.",
      "Pour the dressing over the salad ingredients and toss gently to coat all the components evenly.",
      "Serve Asian Sesame Chicken Salad immediately as a main course, garnished with additional sesame seeds if desired.",
      "Enjoy your homemade Asian Sesame Chicken Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Sesame-infused",
      "Tangy"
    ],
    "time": "30 minutes",
    "best": "Cold"
  },
  {
    "id": 21,
    "name": "Beef Nilaga",
    "image": "https://assets.unileversolutions.com/recipes-v2/214402.png",
    "description": "Beef Nilaga is a hearty Filipino soup made with beef shank, potatoes, cabbage, and corn on the cob. The beef shank is simmered slowly until tender, resulting in a flavorful broth that is rich with the essence of beef and vegetables. This comforting soup is typically enjoyed hot, often served with fish sauce (patis) and calamansi on the side for added seasoning and tanginess.",
    "category": "Main Dish",
    "ingredients": [
      "2 pounds beef shank, cut into chunks",
      "1 onion, quartered",
      "2 tomatoes, quartered",
      "1 tablespoon whole peppercorns",
      "8 cups water",
      "2 potatoes, peeled and quartered",
      "1 corn on the cob, cut into pieces",
      "1 small cabbage, quartered",
      "Fish sauce (patis) and calamansi for serving",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "In a large pot, bring water to a boil over medium-high heat.",
      "Add the beef shank, onion, tomatoes, and whole peppercorns. Reduce heat to low, cover, and simmer for 2-3 hours or until the beef is tender.",
      "Add the potatoes and cook for 10 minutes.",
      "Add the corn on the cob and cabbage. Cook for another 5-7 minutes or until the vegetables are tender.",
      "Season with salt and pepper to taste.",
      "Serve hot with fish sauce (patis) and calamansi on the side.",
      "Enjoy your Beef Nilaga!"
    ],
    "servings": 6,
    "flavors": [
      "Savory",
      "Beefy",
      "Comforting"
    ],
    "time": "3 hours",
    "best": "Hot"
  },
  {
    "id": 30,
    "name": "Mexican Hot Chocolate",
    "image": "https://www.goya.com/media/3196/champurrado-thick-mexican-hot-chocolate.jpg?quality=80",
    "description": "Mexican Hot Chocolate is a spiced and rich beverage that combines chocolate with cinnamon, vanilla, and a touch of chili powder. It's traditionally made with Mexican chocolate tablets that contain cinnamon, but you can also use cocoa powder and spices for a homemade version. This comforting drink is served hot and often topped with whipped cream or a sprinkle of cinnamon. Mexican Hot Chocolate offers a delightful blend of sweet, spicy, and aromatic flavors that warm you up on cold days.",
    "category": "Beverage",
    "ingredients": [
      "2 cups milk",
      "2 ounces Mexican chocolate tablets (or 2 tablespoons unsweetened cocoa powder)",
      "1/2 teaspoon ground cinnamon",
      "1/4 teaspoon vanilla extract",
      "Pinch of chili powder or cayenne pepper (optional)",
      "Whipped cream and cinnamon for garnish (optional)"
    ],
    "instructions": [
      "In a small saucepan, heat milk over medium heat until warmed (but not boiling).",
      "If using Mexican chocolate tablets, grate them and add to the warm milk, stirring until melted and smooth. If using cocoa powder, whisk it into the warm milk until dissolved.",
      "Stir in ground cinnamon, vanilla extract, and chili powder or cayenne pepper if using.",
      "Pour into mugs and top with whipped cream and a sprinkle of cinnamon if desired.",
      "Serve hot and enjoy your Mexican Hot Chocolate!"
    ],
    "servings": 2,
    "flavors": [
      "Rich",
      "Spicy",
      "Chocolatey"
    ],
    "time": "10 minutes",
    "best": "Hot"
  },
  {
    "id": 55,
    "name": "Fried Rice",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JHZAHWPRG3IN3U7YKXBWVHIQUA.jpg&w=1440",
    "description": "Fried Rice is a versatile dish featuring cooked rice stir-fried with vegetables, eggs, and your choice of protein. This savory and satisfying dish is seasoned with soy sauce and sesame oil for a rich umami flavor. Enjoy it as a main course or side dish, perfect for using up leftover rice and creating a quick meal.",
    "category": "Fried or Grilled",
    "ingredients": [
      "3 cups cooked rice, chilled (preferably day-old)",
      "2 tablespoons vegetable oil",
      "2 eggs, lightly beaten",
      "1 cup mixed vegetables (such as peas, carrots, and corn)",
      "1/2 cup diced cooked chicken, shrimp, or tofu (optional)",
      "2 tablespoons soy sauce",
      "1 tablespoon oyster sauce (optional)",
      "1 teaspoon sesame oil",
      "Salt and black pepper, to taste",
      "2 green onions, chopped, for garnish"
    ],
    "instructions": [
      "Heat 1 tablespoon of vegetable oil in a large skillet or wok over medium heat.",
      "Add beaten eggs and scramble until cooked through. Remove eggs from skillet and set aside.",
      "Add remaining tablespoon of vegetable oil to the skillet. Stir-fry mixed vegetables until tender-crisp.",
      "If using, add diced chicken, shrimp, or tofu to the skillet and cook until heated through.",
      "Add chilled cooked rice to the skillet, breaking up any clumps with a spatula.",
      "Drizzle soy sauce, oyster sauce (if using), and sesame oil over the rice. Stir-fry until well combined.",
      "Return scrambled eggs to the skillet and toss everything together. Season with salt and black pepper to taste.",
      "Garnish with chopped green onions and serve hot.",
      "Enjoy your homemade Fried Rice!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Umami",
      "Comforting"
    ],
    "time": "20 minutes",
    "best": "Hot"
  },
  {
    "id": 44,
    "name": "Blueberry Muffins",
    "image": "https://www.melskitchencafe.com/wp-content/uploads/2023/03/best-blueberry-muffins14.jpg",
    "description": "Blueberry Muffins are tender and moist muffins bursting with juicy blueberries in every bite. These muffins have a hint of lemon zest and a delicate crumb, making them a delightful breakfast or snack option for blueberry lovers.",
    "category": "Baked Goods",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 tablespoon baking powder",
      "1/2 teaspoon salt",
      "1/2 cup unsalted butter, melted and cooled",
      "1 cup granulated sugar",
      "2 large eggs",
      "1 cup milk",
      "1 teaspoon vanilla extract",
      "1 tablespoon lemon zest",
      "1 1/2 cups fresh or frozen blueberries"
    ],
    "instructions": [
      "Preheat oven to 375°F (190°C). Line a 12-cup muffin tin with paper liners or grease with non-stick spray.",
      "In a large bowl, whisk together flour, baking powder, and salt.",
      "In another bowl, whisk together melted butter and sugar until well combined.",
      "Add eggs, one at a time, whisking well after each addition.",
      "Whisk in milk, vanilla extract, and lemon zest.",
      "Add wet ingredients to dry ingredients and stir until just combined. Do not overmix.",
      "Gently fold in blueberries.",
      "Divide batter evenly among muffin cups, filling each about 3/4 full.",
      "Bake for 18-20 minutes, or until a toothpick inserted into the center comes out clean.",
      "Cool muffins in the pan for 5 minutes, then transfer to a wire rack to cool completely.",
      "Enjoy your homemade Blueberry Muffins!"
    ],
    "servings": 12,
    "flavors": [
      "Sweet",
      "Tangy",
      "Buttery"
    ],
    "time": "35 minutes",
    "best": "Warm"
  },
  {
    "id": 20,
    "name": "Japanese Curry",
    "image": "https://assets.bonappetit.com/photos/61a7d632234db3ec67e4fdfa/master/pass/20211122%20Japanese%20Curry%20LEDE.jpg",
    "description": "Japanese Curry is a comforting and flavorful dish that combines tender meat (often beef or chicken), potatoes, carrots, and onions in a thick and mildly spicy curry sauce. Unlike Indian or Thai curries, Japanese curry is milder and slightly sweet, thanks to the addition of apples or honey in the sauce. It is typically served over steamed rice and enjoyed hot, making it a popular choice for lunch or dinner in Japan.",
    "category": "Main Dish",
    "ingredients": [
      "1 pound beef stew meat, cubed",
      "2 potatoes, peeled and diced",
      "2 carrots, peeled and diced",
      "1 onion, thinly sliced",
      "2 tablespoons vegetable oil",
      "4 cups water or beef broth",
      "1 package Japanese curry roux (like S&B Golden Curry)",
      "1 apple, grated (optional)",
      "2 tablespoons soy sauce",
      "1 tablespoon Worcestershire sauce",
      "1 tablespoon honey or sugar",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "In a large pot or Dutch oven, heat vegetable oil over medium-high heat. Add the beef cubes and cook until browned on all sides.",
      "Add the sliced onions and cook until translucent.",
      "Add water or beef broth, potatoes, and carrots. Bring to a boil, then reduce heat and simmer until vegetables are tender, about 20 minutes.",
      "Stir in Japanese curry roux, grated apple (if using), soy sauce, Worcestershire sauce, honey or sugar. Simmer for another 10 minutes, stirring occasionally, until the curry sauce thickens.",
      "Season with salt and pepper to taste.",
      "Serve hot over steamed rice.",
      "Enjoy your Japanese Curry!"
    ],
    "servings": 4,
    "flavors": [
      "Savory",
      "Mildly Spicy",
      "Sweet"
    ],
    "time": "1 hour",
    "best": "Hot"
  },
  {
    "id": 70,
    "name": "Caprese Salad",
    "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2019/07/Caprese-Salad-main-1.jpg",
    "description": "Caprese Salad is a simple yet elegant Italian salad showcasing ripe tomatoes, fresh mozzarella cheese, and fragrant basil leaves. Drizzled with balsamic glaze and extra virgin olive oil, this salad highlights the flavors of summer with its vibrant colors and delightful combination of textures. Serve Caprese Salad as an appetizer or side dish for a taste of Italy.",
    "category": "Salad",
    "ingredients": [
      "2 large tomatoes, sliced",
      "8 oz fresh mozzarella cheese, sliced",
      "Fresh basil leaves",
      "Balsamic glaze, for drizzling",
      "Extra virgin olive oil, for drizzling",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "Arrange tomato slices and fresh mozzarella cheese slices on a serving platter, alternating between them.",
      "Tuck fresh basil leaves between the tomato and mozzarella slices.",
      "Drizzle balsamic glaze and extra virgin olive oil over the salad. Season with salt and black pepper to taste.",
      "Serve Caprese Salad immediately as an appetizer or side dish.",
      "Enjoy your homemade Caprese Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Fresh",
      "Creamy",
      "Herbaceous"
    ],
    "time": "10 minutes",
    "best": "Cold"
  },
  {
    "id": 24,
    "name": "Iced Matcha Latte",
    "image": "https://www.foodandwine.com/thmb/2tI8aL1Z8hKhfV48_c8b6uWG-TQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Iced-Matcha-Latte-FT-RECIPE0622-2000-9c2e116d3bc54bdaacda10e62e8e0205.jpg",
    "description": "Iced Matcha Latte is a refreshing Japanese-inspired beverage made with matcha green tea powder, milk, and sweetener. It has a vibrant green color and a slightly bitter, earthy flavors that pairs perfectly with the creamy milk. This latte is served over ice, making it a cool and energizing drink that's perfect for warm weather. Enjoy the antioxidant benefits of matcha while savoring its unique flavors profile in this delightful iced beverage.",
    "category": "Beverage",
    "ingredients": [
      "2 teaspoons matcha green tea powder",
      "2 tablespoons hot water",
      "1 cup milk",
      "1 tablespoon honey or sweetener of choice",
      "Ice cubes"
    ],
    "instructions": [
      "In a glass or shaker, whisk matcha powder with hot water until smooth.",
      "Add honey or sweetener and stir until dissolved.",
      "Fill the glass with ice cubes.",
      "Pour milk over the ice.",
      "Slowly pour the matcha mixture over the milk.",
      "Stir gently to combine.",
      "Serve immediately and enjoy your Iced Matcha Latte!"
    ],
    "servings": 1,
    "flavors": [
      "Earthy",
      "Creamy",
      "Sweet"
    ],
    "time": "5 minutes",
    "best": "Cold"
  },
  {
    "id": 63,
    "name": "Cioppino",
    "image": "https://www.allrecipes.com/thmb/0s1NugH5SGHWm2tNCXL0eJX-LU4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/12816-cioppino-ARMag-DEC2020_09971-f5eded3dc22347109ac5fc032715d673.jpg",
    "description": "Cioppino is a hearty seafood stew originating from San Francisco, filled with a variety of fresh seafood such as shrimp, clams, mussels, and fish simmered in a rich tomato broth with wine and herbs. This flavorful stew is perfect for showcasing the bounty of the sea and is best enjoyed with crusty bread for dipping.",
    "category": "Seafood",
    "ingredients": [
      "1 lb mixed seafood (shrimp, clams, mussels, fish), cleaned and scrubbed",
      "2 tablespoons olive oil",
      "1 onion, diced",
      "2 cloves garlic, minced",
      "1/2 cup white wine",
      "1 can (28 oz) crushed tomatoes",
      "2 cups fish or seafood broth",
      "1 teaspoon dried oregano",
      "1 teaspoon dried thyme",
      "Salt and black pepper, to taste",
      "Fresh parsley, chopped, for garnish",
      "Crusty bread, for serving"
    ],
    "instructions": [
      "In a large pot or Dutch oven, heat olive oil over medium heat. Add diced onion and sauté until softened, about 5 minutes.",
      "Add minced garlic to the pot and cook for 1 minute until fragrant.",
      "Deglaze the pot with white wine, scraping up any browned bits from the bottom.",
      "Stir in crushed tomatoes, fish or seafood broth, dried oregano, and dried thyme. Season with salt and black pepper to taste.",
      "Bring the stew to a boil, then reduce heat to low and simmer for 20-25 minutes to allow flavors to meld together.",
      "Add mixed seafood to the pot and cook for 5-7 minutes until seafood is cooked through and shells have opened.",
      "Remove from heat and sprinkle chopped fresh parsley over the Cioppino.",
      "Serve hot with crusty bread for dipping.",
      "Enjoy your homemade Cioppino!"
    ],
    "servings": 4,
    "flavors": [
      "Rich",
      "Tomatoey",
      "Herb-infused"
    ],
    "time": "45 minutes",
    "best": "Hot"
  },
  {
    "id": 58,
    "name": "Fried Calamari",
    "image": "https://www.willcookforsmiles.com/wp-content/uploads/2021/07/Calamari-5.jpg",
    "description": "Fried Calamari is a delicious appetizer featuring tender rings of squid coated in a crispy seasoned batter. This dish is quick and easy to prepare, perfect for serving with a squeeze of lemon and marinara sauce for dipping. Enjoy crispy fried calamari as a delightful starter or main dish.",
    "category": "Fried or Grilled",
    "ingredients": [
      "1 lb squid (calamari), cleaned and cut into rings",
      "1 cup all-purpose flour",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "1/2 teaspoon paprika",
      "Vegetable oil, for frying",
      "Lemon wedges and marinara sauce, for serving"
    ],
    "instructions": [
      "In a bowl, combine flour, salt, black pepper, and paprika.",
      "Heat vegetable oil in a large skillet or pot over medium-high heat until it reaches 350°F (175°C).",
      "Dredge calamari rings in the seasoned flour mixture, shaking off excess.",
      "Fry calamari in batches for 2-3 minutes until golden brown and crispy. Avoid overcrowding the skillet.",
      "Transfer fried calamari to a paper towel-lined plate to drain excess oil.",
      "Serve hot with lemon wedges and marinara sauce for dipping.",
      "Enjoy your homemade Fried Calamari!"
    ],
    "servings": 4,
    "flavors": [
      "Crispy",
      "Seafood",
      "Zesty"
    ],
    "time": "30 minutes",
    "best": "Hot"
  },
  {
    "id": 1,
    "name": "Chocolate Chip Cookies",
    "image": "https://staticcookist.akamaized.net/wp-content/uploads/sites/22/2022/02/Chocolate-chip-cookies-14-1200x675.jpg",
    "description": "Classic chocolate chip cookies with a crispy exterior and a chewy interior. These cookies are packed with rich, semi-sweet chocolate chips that melt in your mouth. Perfect for any occasion, their buttery flavors is enhanced by a hint of vanilla. Enjoy them warm from the oven or dunked in a cold glass of milk. They're sure to be a hit with kids and adults alike!",
    "category": "Dessert",
    "ingredients": [
      "1 cup unsalted butter, softened",
      "1 cup granulated sugar",
      "1 cup packed brown sugar",
      "2 large eggs",
      "1 teaspoon vanilla extract",
      "3 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1/2 teaspoon baking powder",
      "1/2 teaspoon salt",
      "2 cups semisweet chocolate chips"
    ],
    "instructions": [
      "Preheat the oven to 350°F (175°C).",
      "In a large bowl, cream together the butter, granulated sugar, and brown sugar until smooth.",
      "Beat in the eggs one at a time, then stir in the vanilla.",
      "Combine the flour, baking soda, baking powder, and salt; gradually blend into the creamed mixture.",
      "Stir in the chocolate chips by hand using a wooden spoon.",
      "Drop cookie dough 1/4 cup at a time onto ungreased baking sheets. Cookies should be about 3 inches apart.",
      "Bake for 10 to 12 minutes in the preheated oven, or until edges are nicely browned.",
      "Cool on baking sheets for a few minutes before transferring to wire racks to cool completely."
    ],
    "servings": 24,
    "flavors": [
      "Sweet"
    ],
    "time": "30 minutes",
    "best": "Cold"
  },
  {
    "id": 6,
    "name": "Pavlova",
    "image": "https://www.giallozafferano.com/images/255-25531/Pavlova_1200x800.jpg",
    "description": "Pavlova is a light and airy meringue dessert with a crisp crust and soft, marshmallow-like interior. Topped with whipped cream and fresh fruit, it offers a delightful contrast of textures and flavorss. The meringue base is crispy yet delicate, providing a sweet and slightly chewy experience with every bite. It is beautifully complemented by billowy whipped cream and a colorful array of fresh fruits, making it a stunning centerpiece for any dessert table.",
    "category": "Dessert",
    "ingredients": [
      "4 large egg whites",
      "1 cup granulated sugar",
      "1 teaspoon white vinegar",
      "1 teaspoon vanilla extract",
      "1 tablespoon cornstarch",
      "1 1/4 cups heavy cream",
      "2 tablespoons granulated sugar",
      "Fresh fruit for topping (such as strawberries, kiwi, and blueberries)"
    ],
    "instructions": [
      "Preheat the oven to 300°F (150°C). Line a baking sheet with parchment paper. Draw a 9-inch circle on the parchment paper as a guide.",
      "In a large bowl, beat egg whites until soft peaks form. Gradually add the 1 cup sugar, beating until stiff, glossy peaks form.",
      "Beat in the vinegar and vanilla. Sift cornstarch over the top and fold in gently.",
      "Spoon meringue onto the parchment paper within the circle. Shape into a disc with a slight depression in the center.",
      "Bake for 1 hour. Turn off the oven and let the meringue cool completely in the oven with the door slightly ajar.",
      "In a medium bowl, beat the heavy cream with 2 tablespoons sugar until soft peaks form.",
      "Spoon whipped cream onto the cooled meringue and top with fresh fruit."
    ],
    "servings": 8,
    "flavors": [
      "Sweet"
    ],
    "time": "2 hours",
    "best": "Cold"
  },
  {
    "id": 49,
    "name": "Vanilla Pound Cake",
    "image": "https://www.imperialsugar.com/sites/default/files/recipe/Vanilla-Pound-Cake-imperial.jpg",
    "description": "Vanilla Pound Cake is a rich and buttery cake with a dense yet tender crumb. Enhanced with vanilla bean paste for a robust vanilla flavor, this cake is perfect for serving plain, with fresh fruit, or topped with whipped cream for a delightful dessert or tea-time treat.",
    "category": "Baked Goods",
    "ingredients": [
      "1 cup unsalted butter, softened",
      "2 cups granulated sugar",
      "4 large eggs",
      "1 teaspoon vanilla bean paste or vanilla extract",
      "1/4 cup sour cream",
      "2 1/2 cups all-purpose flour",
      "1/2 teaspoon baking powder",
      "1/4 teaspoon salt",
      "1/2 cup milk"
    ],
    "instructions": [
      "Preheat oven to 325°F (160°C). Grease and flour a 9x5-inch loaf pan.",
      "In a large bowl, cream together softened butter and granulated sugar until light and fluffy.",
      "Beat in eggs one at a time, then stir in vanilla bean paste or vanilla extract and sour cream.",
      "Combine flour, baking powder, and salt; gradually add to creamed mixture alternately with milk, beginning and ending with flour mixture.",
      "Pour batter into prepared loaf pan, spreading evenly.",
      "Bake for 70-80 minutes or until a toothpick inserted into the center comes out clean.",
      "Cool cake in the pan for 10 minutes before removing to a wire rack to cool completely.",
      "Slice and enjoy your homemade Vanilla Pound Cake!"
    ],
    "servings": 12,
    "flavors": [
      "Buttery",
      "Vanilla",
      "Rich"
    ],
    "time": "1 hour 30 minutes",
    "best": "Room temperature"
  },
  {
    "id": 51,
    "name": "Pandesal",
    "image": "https://www.seriouseats.com/thmb/7kr-XVmqA779335Unu85HBAMsz8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210617-pandesal-vicky-wasik-seriouseats-seriouseats-21-8d33fc988da34901b763a1d1f3ce6a4b.jpg",
    "description": "Pandesal is a classic Filipino bread roll that is soft, fluffy, and slightly sweet. It is traditionally enjoyed as a breakfast bread or snack, often paired with butter, cheese, or jams. The crust is lightly crunchy while the inside is tender and chewy, making it a beloved staple in Filipino cuisine.",
    "category": "Baked Goods",
    "ingredients": [
      "4 cups bread flour",
      "1/2 cup granulated sugar",
      "1 teaspoon salt",
      "1 tablespoon active dry yeast",
      "1 cup lukewarm water",
      "1/2 cup evaporated milk",
      "1/4 cup unsalted butter, melted",
      "1/2 cup bread crumbs, for coating"
    ],
    "instructions": [
      "In a large bowl, combine lukewarm water, sugar, and yeast. Let sit for 5-10 minutes until foamy.",
      "Add evaporated milk, melted butter, and salt to the yeast mixture, stirring until well combined.",
      "Gradually add bread flour, mixing until dough comes together.",
      "Transfer dough to a lightly floured surface and knead for 10-12 minutes until smooth and elastic.",
      "Place dough in a greased bowl, cover with a clean towel, and let rise in a warm place for 1-2 hours until doubled in size.",
      "Punch down dough and divide into 24 equal portions. Shape each portion into a ball.",
      "Roll each ball in bread crumbs, coating evenly, and place on a parchment-lined baking sheet.",
      "Cover shaped dough with a towel and let rise again for 30-45 minutes until puffy.",
      "Preheat oven to 350°F (175°C).",
      "Bake pandesal for 18-20 minutes until golden brown.",
      "Cool on a wire rack before serving.",
      "Enjoy your homemade Pandesal!"
    ],
    "servings": 24,
    "flavors": [
      "Sweet",
      "Soft",
      "Slightly Crunchy"
    ],
    "time": "3 hours",
    "best": "Warm"
  },
  {
    "id": 74,
    "name": "Mexican Street Corn Salad",
    "image": "https://www.eatwell101.com/wp-content/uploads/2023/05/Mexican-Street-Corn-Salad-recipe.jpg",
    "description": "Mexican Street Corn Salad, also known as 'Esquites', is a vibrant salad featuring charred corn kernels tossed with creamy mayonnaise, tangy lime juice, chili powder, and crumbled cotija cheese. Garnished with fresh cilantro and a hint of smoky paprika, this salad offers a burst of flavors reminiscent of traditional street food. Serve Mexican Street Corn Salad as a side dish or appetizer.",
    "category": "Salad",
    "ingredients": [
      "4 cups fresh corn kernels (about 4 ears of corn)",
      "1/2 cup mayonnaise",
      "1/4 cup sour cream",
      "1/4 cup cotija cheese, crumbled",
      "1/4 cup fresh cilantro, chopped",
      "1 jalapeno pepper, seeded and minced",
      "2 tablespoons fresh lime juice",
      "1 teaspoon chili powder",
      "1/2 teaspoon smoked paprika",
      "Salt and black pepper, to taste"
    ],
    "instructions": [
      "In a large skillet over medium-high heat, char the fresh corn kernels until lightly browned and caramelized.",
      "Transfer the charred corn kernels to a large bowl. Add mayonnaise, sour cream, crumbled cotija cheese, chopped fresh cilantro, seeded and minced jalapeno pepper, fresh lime juice, chili powder, smoked paprika, salt, and black pepper.",
      "Toss all the ingredients together until well combined and evenly coated with the dressing.",
      "Serve Mexican Street Corn Salad immediately as a flavorful side dish or appetizer.",
      "Enjoy your homemade Mexican Street Corn Salad!"
    ],
    "servings": 4,
    "flavors": [
      "Creamy",
      "Tangy",
      "Spicy"
    ],
    "time": "20 minutes",
    "best": "Cold"
  },
  {
    "id": 37,
    "name": "Minestrone Soup",
    "image": "https://cdn.loveandlemons.com/wp-content/uploads/2021/11/minestrone-soup.jpg",
    "description": "Minestrone Soup is a hearty Italian soup filled with vegetables, beans, pasta, and aromatic herbs in a flavorful tomato broth. It's a versatile dish that can include a variety of seasonal vegetables such as carrots, celery, zucchini, and spinach. Minestrone Soup is nourishing and satisfying, perfect for chilly evenings or as a starter for an Italian-inspired meal.",
    "category": "Soup or Stew",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 onion, chopped",
      "2 carrots, diced",
      "2 celery stalks, diced",
      "3 garlic cloves, minced",
      "1 zucchini, diced",
      "1 cup green beans, cut into 1-inch pieces",
      "1 can (15 ounces) diced tomatoes",
      "6 cups vegetable broth",
      "1 can (15 ounces) cannellini beans, drained and rinsed",
      "1 cup small pasta (such as ditalini or small shells)",
      "1 teaspoon dried oregano",
      "1 teaspoon dried basil",
      "Salt and pepper to taste",
      "Grated Parmesan cheese for serving"
    ],
    "instructions": [
      "In a large pot, heat olive oil over medium heat.",
      "Add onion, carrots, celery, and garlic. Cook until vegetables are softened, about 5-7 minutes.",
      "Add zucchini, green beans, diced tomatoes with their juices, and vegetable broth.",
      "Bring to a boil, then reduce heat to low and simmer uncovered for 15 minutes.",
      "Add cannellini beans, pasta, dried oregano, and dried basil. Cook until pasta is al dente, about 10 minutes.",
      "Season with salt and pepper to taste.",
      "Serve hot, garnished with grated Parmesan cheese.",
      "Enjoy your hearty Minestrone Soup!"
    ],
    "servings": 6,
    "flavors": [
      "Hearty",
      "Savory",
      "Tomatoey"
    ],
    "time": "40 minutes",
    "best": "Hot"
  },
  {
    "id": 17,
    "name": "Ratatouille",
    "image": "https://www.mashed.com/img/gallery/disney-ratatouille/l-intro-1620047814.jpg",
    "description": "Ratatouille is a classic French Provençal stewed vegetable dish originating from Nice. It is made with a variety of seasonal vegetables including eggplant, zucchini, bell peppers, onions, garlic, and tomatoes, cooked slowly until tender and flavorful. The vegetables are typically sautéed separately to enhance their individual flavors, then combined and simmered together in a rich tomato sauce infused with herbs like thyme, basil, and oregano. Ratatouille is a versatile dish that can be served hot or cold, as a main dish or a side, making it a perfect choice for vegetarians and vegans alike.",
    "category": "Main Dish",
    "ingredients": [
      "1 eggplant, diced",
      "2 zucchini, diced",
      "1 yellow bell pepper, diced",
      "1 red bell pepper, diced",
      "1 onion, diced",
      "4 cloves garlic, minced",
      "2 cups diced tomatoes (canned or fresh)",
      "2 tablespoons tomato paste",
      "1 teaspoon dried thyme",
      "1 teaspoon dried basil",
      "1 teaspoon dried oregano",
      "Salt and pepper to taste",
      "2 tablespoons olive oil",
      "Fresh basil leaves for garnish"
    ],
    "instructions": [
      "Heat 1 tablespoon of olive oil in a large skillet or Dutch oven over medium heat. Add the diced eggplant and cook for 5-6 minutes until softened and lightly browned. Remove from the skillet and set aside.",
      "Add another tablespoon of olive oil to the skillet. Add the diced zucchini and bell peppers, and sauté for 4-5 minutes until slightly tender. Remove from the skillet and set aside with the eggplant.",
      "In the same skillet, add the diced onion and cook for 3-4 minutes until softened and translucent.",
      "Add the minced garlic and cook for another minute until fragrant.",
      "Stir in the diced tomatoes, tomato paste, dried thyme, dried basil, and dried oregano. Season with salt and pepper to taste.",
      "Return the cooked eggplant, zucchini, and bell peppers to the skillet. Stir to combine with the tomato mixture.",
      "Simmer the Ratatouille over low heat for 20-25 minutes, stirring occasionally, until the vegetables are tender and the flavors have melded together.",
      "Taste and adjust seasoning if needed.",
      "Serve the Ratatouille hot, garnished with fresh basil leaves.",
      "Enjoy your Ratatouille!"
    ],
    "servings": 6,
    "flavors": [
      "Savory"
    ],
    "time": "45 minutes",
    "best": "Warm"
  },
  {
    "id": 29,
    "name": "Strawberry Banana Smoothie",
    "image": "https://buildyourbite.com/wp-content/uploads/2018/09/Strawberry-Banana-Smoothie-compressed-21.jpg",
    "description": "Strawberry Banana Smoothie is a refreshing and nutritious blended drink made with fresh strawberries, ripe bananas, yogurt, and a splash of orange juice. It has a creamy texture and a naturally sweet flavors from the fruits, enhanced by the tangy yogurt and citrusy orange juice. This smoothie is packed with vitamins and antioxidants, making it a healthy and satisfying choice for breakfast or as a quick energy boost during the day.",
    "category": "Beverage",
    "ingredients": [
      "1 cup fresh strawberries, hulled",
      "1 ripe banana, peeled",
      "1/2 cup plain yogurt",
      "1/2 cup orange juice",
      "1 tablespoon honey or agave syrup (optional)",
      "Ice cubes"
    ],
    "instructions": [
      "In a blender, combine strawberries, banana, yogurt, orange juice, and honey or agave syrup if using.",
      "Blend until smooth and creamy.",
      "Add ice cubes and blend again until desired consistency.",
      "Pour into glasses and serve immediately.",
      "Enjoy your refreshing Strawberry Banana Smoothie!"
    ],
    "servings": 2,
    "flavors": [
      "Fruity",
      "Creamy",
      "Sweet"
    ],
    "time": "5 minutes",
    "best": "Cold"
  },
  {
    "id": 13,
    "name": "Beef Wellington",
    "image": "https://img.hellofresh.com/f_auto,fl_lossy,q_auto,w_1200/hellofresh_s3/image/beef-wellington-with-mushroom-sauce-5e7e6ffa.jpg",
    "description": "Beef Wellington is an elegant and decadent dish featuring a tender beef fillet coated with mushroom duxelles, wrapped in puff pastry, and baked until golden brown. The beef is seared to seal in juices, then coated with a savory mixture of finely chopped mushrooms, shallots, garlic, and herbs. The puff pastry envelops the beef, creating a flaky, buttery crust that contrasts beautifully with the tender meat and earthy mushroom filling. Beef Wellington is often served with a rich red wine sauce, making it a luxurious centerpiece for special occasions.",
    "category": "Main Dish",
    "ingredients": [
      "1 whole beef tenderloin, about 2 pounds",
      "Salt and pepper to taste",
      "2 tablespoons olive oil",
      "8 ounces cremini or button mushrooms, finely chopped",
      "2 shallots, finely chopped",
      "2 cloves garlic, minced",
      "1 tablespoon fresh thyme leaves",
      "1 sheet puff pastry, thawed if frozen",
      "1 egg, beaten"
    ],
    "instructions": [
      "Preheat the oven to 400°F (200°C). Season the beef tenderloin generously with salt and pepper.",
      "In a large skillet, heat the olive oil over high heat. Sear the beef on all sides until browned, about 2-3 minutes per side. Remove from the skillet and let cool.",
      "In the same skillet, add a little more olive oil if needed. Add the chopped mushrooms, shallots, garlic, and thyme. Cook until the mushrooms release their liquid and the mixture becomes dry, about 10 minutes. Season with salt and pepper.",
      "Roll out the puff pastry on a lightly floured surface to a size that will wrap around the beef completely.",
      "Spread the mushroom mixture evenly over the puff pastry. Place the seared beef on top of the mushroom mixture.",
      "Fold the puff pastry over the beef, sealing the edges. Trim any excess pastry and crimp the edges to seal.",
      "Brush the pastry with beaten egg for a golden finish.",
      "Transfer the Beef Wellington to a baking sheet lined with parchment paper. Bake in the preheated oven for 35-40 minutes, or until the pastry is golden brown and the internal temperature of the beef reaches 125°F (52°C) for medium-rare.",
      "Let the Beef Wellington rest for 10 minutes before slicing. Serve with a rich red wine sauce.",
      "Enjoy your Beef Wellington!"
    ],
    "servings": 6,
    "flavors": [
      "Savory",
      "Buttery"
    ],
    "time": "1 hour and 30 minutes",
    "best": "Hot"
  }
]